#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:nil todo:t |:t
#+TITLE: Dust wave case studies
#+AUTHOR: William Henney
#+EMAIL: will@henney.org
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport


Case studies of interesting objects for inclusion in bow paper X

** SEDs from some objects
Carina ERO 21 (Sickle)
|       |  70/\lambda | F_\nu                  | SED             |
|-------+-------+----------------------+-----------------|
| 4.493 | 15.58 | 0.1698 +/- 0.0140    | 0.02 +/- 2.7e-3 |
| 5.731 | 12.21 | 1.5471 +/- 0.0116    | 0.14 +/- 0.02   |
| 7.872 |  8.89 | 3.9551 +/- 0.1163    | 0.26 +/- 0.03   |
|    70 |     1 | 135.0000 +/- 15.0000 | 1.00 +/- 0.16   |
|   160 |  0.44 | 45.0000 +/- 6.0000   | 0.15 +/- 0.03   |
#+TBLFM: $2=70/$1;f2::$4=$2 $3 / @5$2 @5$3;f2

Carina ERO 36
|       | 70/\lambda | F_\nu               | SED           |
|-------+------+-------------------+---------------|
| 7.872 | 8.89 | 0.0790 +/- 0.0451 | 0.11 +/- 0.07 |
|    22 | 3.18 | 2.8200 +/- 0.5640 | 1.43 +/- 0.34 |
| 23.68 | 2.96 | 3.4630 +/- 0.2256 | 1.64 +/- 0.23 |
|    70 |    1 | 6.2500 +/- 0.7813 | 1.00 +/- 0.18 |
|   160 | 0.44 | 2.7344 +/- 0.7813 | 0.19 +/- 0.06 |
#+TBLFM: $2=70/$1;f2::$4=$2 $3 / @5$2 @5$3;f2

Carina ERO 36 BG
|       | 70/\lambda | S_\nu          | SED           |
|-------+------+--------------+---------------|
| 7.872 | 8.89 | 40. +/- 4.   | 0.36 +/- 0.04 |
|    22 | 3.18 | 280. +/- 30. | 0.89 +/- 0.10 |
| 23.68 | 2.96 | 120. +/- 20. | 0.36 +/- 0.06 |
|    70 |    1 | 997. +/- 42. | 1.00 +/- 0.06 |
|   160 | 0.44 | 956. +/- 42. | 0.42 +/- 0.03 |
#+TBLFM: $2=70/$1;f2::$4=$2 $3 / @5$2 @5$3;f2

Carina ERO 5
|       |  70/\lambda | S_\nu               | SED            |
|-------+-------+-------------------+----------------|
| 4.493 | 15.58 | 0.0025 +/- 0.0019 | 0.13 +/- 0.10  |
| 5.731 | 12.21 | 0.0162 +/- 0.0050 | 0.68 +/- 0.21  |
| 7.872 |  8.89 | 0.1306 +/- 0.0062 | 3.96 +/- 0.19  |
|    22 |  3.18 | 1.4100 +/- 0.2820 | 15.30 +/- 3.06 |
| 23.68 |  2.96 | 2.1009 +/- 0.2820 | 21.22 +/- 2.85 |
|    70 |     1 | 0.2930 +/- 0.2344 | 1.00 +/- 0.80  |
|   160 |  0.44 | 0.0000 +/- 0.2344 | 0.00 +/- 0.35  |
#+TBLFM: $2=70/$1;f2::$4=$2 $3 / @7$2 0.293;f2

Carina ERO 5 BG
|       |  70/\lambda | S_\nu           | SED           |
|-------+-------+---------------+---------------|
| 4.493 | 15.58 | 5. +/- 2.     | 0.04 +/- 0.02 |
| 5.731 | 12.21 | 17. +/- 4.    | 0.11 +/- 0.03 |
| 7.872 |  8.89 | 65. +/- 5.    | 0.31 +/- 0.03 |
|    22 |  3.18 | 600. +/- 100. | 1.02 +/- 0.18 |
| 23.68 |  2.96 | 400. +/- 100. | 0.63 +/- 0.16 |
|    70 |     1 | 1870. +/- 83. | 1.00 +/- 0.06 |
|   160 |  0.44 | 1745. +/- 83. | 0.41 +/- 0.03 |
#+TBLFM: $2=70/$1;f2::$4=$2 $3 / @7$2 @7$3;f2

Ratios from Draine:2007a
| Ratio     | P7.9            | P24            | R71         |
|-----------+-----------------+----------------+-------------|
| ERO 21    | 0.226 +/- 0.006 |                | 1.4 +/- 0.2 |
| ERO 36    | 0.066 +/- 0.038 | 6.7 +/- 1.3    | 5.3 +/- 1.7 |
| ERO 36 BG | 0.254 +/- 0.029 | 0.25 +/- 0.04  | 2.4 +/- 0.2 |
| ERO 5     | 3.960 +/- 1.399 | 21.22 +/- 7.96 | > 3         |
| ERO 5 BG  | 0.220 +/- 0.022 | 0.45 +/- 0.11  | 2.4 +/- 0.2 |
#+TBLFM: @2$2=0.26/(1 + 0.15 +/- 0.03);f3::@2$4=1.64 +/- 0.23 / (1 + 0.19 +/- 0.06 );f1::@3$2=0.0790 +/- 0.0451 / (1 + 0.19 +/- 0.06) ;f3::@3$3=1 / 0.15 +/- 0.03 ;f1::@3$4=1/0.19 +/- 0.06;f1::@4$2=0.36 +/- 0.04 / (1 + 0.42 +/- 0.03);f3::@4$3=0.36 +/- 0.06 / (1 + 0.42 +/- 0.03);f2::@4$4=1/0.42 +/- 0.03;f1::@5$2=3.96 +/- 0.19 / (1 + 0.00 +/- 0.35);f3::@5$3=21.22 +/- 2.85 / (1 + 0.00 +/- 0.35);f2::@6$2=0.31 +/- 0.03 / (1 + 0.41 +/- 0.03);f3::@6$3=0.63 +/- 0.16 / (1 + 0.41 +/- 0.03);f2::@6$4=1/0.41 +/- 0.03;f1

+ Figure 
So, objects like 
* Wind radiative momentum efficiency for a broader class of objects
+ We can calculate \eta a lot more broadly than just for OB star winds
  + \eta = 0.495 Mdot(-7) V3 / L4
+ Wolf-Rayet stars
  + Can have \eta > 1, so radiation support is never important (unless \tau is high enough to trap the re-emitted IR radiation too)
+ Strong-wind T Tauri stars
  + Take L = 10 Lsun, Mdot = 1e-8, and V = 200 km/s
  + Gives \eta = 10, implying a non-radiative driving of the wind
+ Proplyds:
  + L = 0.1 Lsun, Mdot = 1e-8, V = 30
  + Gives \eta = 150
+ The outer \eta
  + If \eta_out < \tau, then the bow can be /radiatively confined/
  + If interacting with another stellar wind, then this is just the \eta of the other star
    + For instance, the inner proplyds in Orion that interact with \theta1 C wind
      + Mdot(-7) V3 = 4.2 \pm 1.5 ; L = 2.5e5 Lsun
      + \eta = 0.495 4.2 / 25 = 0.08 
    + The optical depth of the shell in this case is from the inner wind
      + \tau = \kappa \sigma
      + where \sigma = (3 Mdot / 16 \pi R0 Vw)
      + or for proplyd: \sigma = (3 m n0 r0^2 / 4 Ms R0)
        + where r0, n0 are radius and density at i-front
        + Ms \approx 3 is Mach number at shock
        + m is mean mass per nucleon
      + Using R0 = 1e16 R16, n0 = 1e6 n6, r0 = 1e15 r15, \kappa = 600
        + \tau = 0.033 n6 r15^2 / R16
          |   proplyd |   n6 |  r15 |  R16 |      \tau |
          |-----------+------+------+------+--------|
          |   158-233 | 2.33 | 0.63 | 1.12 | 0.0272 |
          |   161-324 | 4.13 | 0.35 |  0.6 | 0.0278 |
          |   163-317 | 3.13 |  0.5 | 1.44 | 0.0179 |
          |   163-323 |   10 | 0.22 | 0.25 | 0.0639 |
          |   166-316 | 4.13 | 0.25 |  0.4 | 0.0213 |
          |   167-317 | 2.60 | 0.79 | 1.12 | 0.0478 |
          | 168-326SE | 2.33 | 0.63 | 0.66 | 0.0462 |
          |   168-328 | 4.00 | 0.28 | 0.46 | 0.0225 |
          |   177-431 | 0.41 | 2.04 | 2.58 | 0.0218 |
          |   180-331 | 0.48 | 1.22 | 0.97 | 0.0243 |
          #+TBLFM: $5=0.033 $2 $3**2 / $4;f4
        + So this is about 0.05 for the strongest case (167-317), which is smaller than \eta, meaning that radiative confinement does not dominate, but might be important
          + /however/, there is evidence that the 11 micron dust opacity

***** How to derive density of dust shell
+ We can estimate \tau for the shell
  + L_{neb} = L_{*} (1 - e^{-\tau}) (\Omega / 4\pi)
    + Assume (\Omega / 4\pi) = 1/2
    + \tau = -ln[ 1 - 2 L_{neb}/L_* ]
  + Absorption \tau in the UV from the MIR SED
    + L_{neb} = 155 Lsun
    + L_{*} = 2000 Lsun if B2
    + => \tau_{abs}(UV) = 0.168 /although it might be slightly higher if we have a peak around 30-40 micron/
  + Scattering \tau in the optical from the optical SED
    + Table of optical reflection nebula (see [[id:16B7695B-DB17-46EE-947F-B833BCFA3451][Plot total SED for LP Ori]])
      |   Wave | dWave |      F |   E(F) |     F* |  E(F*) | Lneb/L*         | \tau_{scat}           |
      |--------+-------+--------+--------+--------+--------+-----------------+-----------------|
      | 0.3359 | 0.060 | 0.0289 | 0.0021 | 0.4914 | 0.0008 | 0.059 +/- 0.004 | 0.126 +/- 0.009 |
      |  0.435 | 0.159 | 0.0165 | 0.0021 | 0.1115 | 0.0008 | 0.148 +/- 0.019 | 0.351 +/- 0.054 |
      |  0.555 | 0.121 | 0.0182 | 0.0024 | 0.1150 | 0.0009 | 0.158 +/- 0.021 | 0.380 +/- 0.061 |
      |  0.775 | 0.155 | 0.0149 | 0.0007 | 0.1085 | 0.0003 | 0.137 +/- 0.006 | 0.320 +/- 0.017 |
      |  0.850 | 0.120 | 0.0133 | 0.0007 | 0.1675 | 0.0002 | 0.079 +/- 0.004 | 0.172 +/- 0.010 |
      #+TBLFM: $7=($3 +/- $4)/($5 +/- $6);f3::$8=-ln(1 - 2 $7) ;f3
    + Conclusion: \tau_{scat}(optical) \approx 0.3 in the optical
+ Now we can estimate the density and hence pressure in the bow shell
  + Assume shell thickness h \approx 0.2 R
  + R \approx 0.01 pc => h \approx 0.002 pc = 6.17e15 cm
  + \tau = \kappa \rho h
  + According to Hazy3 Fig 7.1, we have the following cross-sections for ISM dust
    + Scattering around 0.2 Ryd (5000 \AA): 2e-22 cm^{2}/H => \omega \kappa = 100 cm^{2}/g
    + Absorption around 1 Ryd: 1.6e-21 cm^{2}/H => (1 - \omega) \kappa = 736 cm^{2}/g
    + But this is clearly inconsistent with the observed SED
      + We have \tau_{scat}(optical) \approx \tau_{abs}(UV) (or even higher), whereas the ISM dust has it being 7 times lower
      + [ ] We should calculate the same for the Orion dust
    + For the time being, we will use the optical value as being more credible
  + So we have
    + n = \tau / m \kappa h
    + \tau = 0.3, \kappa = 100 cm^{2}/g, m = 2.17e-24 g, h = 6.17e15 cm
    + => n = 2.24e5 / \kappa_{100} cm^{-3}
    + Column is N = 1.4e21 cm^{-2} 
  + But to calculate the pressure, we need to know if it is ionized or not
  + Ionizing flux from B2 star
    + 6.3e46 s^{-1} according to Smith:2006a
    + L_{4} = 1.55
    + Ionizing flux at R = 0.01 pc is F = 5.26e12
    + ionized layer thickness is h_{i} = F / \alpha_{B} n^{2} = 4e14 cm
      + corresponding to 0.065 arcsec
    + So we have h_i \approx 0.065 h
  + Just for completeness, do flux from th1C
    + R = 0.6 pc - 60 times further away
    + S = 8e48 s^{-1} more or less - 100 times bigger
    + So F = 100/60**2 = 0.0278 times that from LP Ori itself, or 36 times smaller
  + What about H\alpha emission from inner portion?
    + Ionized density, assuming stromgren sphere with R = 0.01 pc
    + 4/3 \pi R^3 n^2 \alpha_B = S
    + n = sqrt(3 S / 4 \pi R^3 \alpha_B) = 4.4e4 pcc
    + Ionized column: 1.35e21 => \tau = 0.295 if \kappa = 100 - suprisingly high!
  + [ ] And the observed Ha brightness
    + Need to calibrate the Ha image
  + Back to the shell pressure
    + Assuming T = 1000 T_{3} K, then pressure is
    + P_{shell} = n k T = 3.12e-8 T_{3}/\kappa_{100} cgs
  + Radiation pressure is (1 - e^{-\tau}) times L / 4\pi R^{2} c
    + The \tau is the rad pressure version, averaged over spectrum, but assume 0.3
    + => (1 - e^{-\tau}) = 0.26 \approx \tau
    + P_{rad} = 1.06e-7 \tau L_{4} cgs
    + With L_{4} = 0.2 and \tau = 0.3 we get P_{rad} = 6.36e-9 cgs
      + So radiation can pressurize the shell if T < 500 K and \kappa > 200 cm^2/g
  + Photoevaporated disk wind
    + With S = 6e46 then Richling:1997a Fig 7 gives
      + Mdot = (3 - 6)e-7
      + Depending on treatment of dust scattering
    + Hollenbach:1994a have an analytic formula:
      + 1e-5 sqrt(M_{10} S_{49}) Msun/yr
      + With M_{10} = 0.7, S_{49} = 0.006, we get 6.5e-7
    + Terminal velocity is about 40 km/s
    + Hence we can calculate the wind momentum efficiency
      + \eta = Mdot V / (L/c)
      + = 3e-7 1.989e33 40 1.0e5 2.99792458e10 / 2000 3.82e33 3.15576e7 
      + = 0.298
  + *Conclusion: wind and radiation contribute equally!*



***** Flux calibration of the H\alpha image
+ The above gives evidence that there is /some/ [N II] emission, but less than H\alpha
+ Taking the zone of the ionized core where we can see [N II], we get the following brightnesses (in counts/s/pix but note that ACS has smaller pixels)
  | Camera |  PHOTFLAM |    W | pixel | Line        | core |  bg | S, erg/s/cm^2/sr |
  |--------+-----------+------+-------+-------------+------+-----+------------------|
  | WFPC2  | 1.454E-17 | 39.2 |   0.1 | [N II]      |  0.2 | 0.1 |           2.4e-4 |
  | WFPC2  | 2.052E-17 | 28.3 |   0.1 | Ha - [N II] | 0.75 | 0.4 |           8.6e-4 |
  | WFPC2  | 4.220E-17 |      |   0.1 | [O III]     |  0.1 | 0.1 |              0e0 |
  | ACS    | 1.999e-18 |   80 |  0.05 | Ha + [N II] | 1.75 | 1.5 |           6.8e-4 |
  #+TBLFM: $8=$2 $3 ($6 - $7) / ($4/206265)**2;s2
+ WFPC2 has
  + f656n :: PHOTFLAM= 2.05238904494382E-17 / Inverse Sensitivity
  + f658n :: PHOTFLAM= 1.454421348314607E-17 / Inverse Sensitivity
  + f502n :: PHOTFLAM= 4.220463483146067E-17 / Inverse Sensitivity
  + f547m :: PHOTFLAM= 1.080204494382022E-18 / Inverse Sensitivity
+ ACS has
  + PHOTFLAM=        1.9991804E-18 / inverse sensitivity, ergs/cm2/Ang/electron
+ This seems too large a difference - a factor of 10 in sensitivity
+ Ah, but we have to then multiply by bandwidth
  + This is 80 \AA for ACS f658n
  + 28.3, 39.2 for WFPC2
  + Still doesn't quite work
+ Also, this is for flux/pixel so we need to divide by pixel area!
  + Now we get within a factor of two or so, which is good enough
  + [ ] Other option would be to use the Doi & O'Dell calibration
+ So H\alpha brightness is about 0.001 erg/s/cm^2/sr
  + Convert to emission measure
  + S = (\alpha_{eff} / 4\pi) h\nu EM
  + \alpha_{eff} = 1e-13 cm^3/s
  + h\nu = (1/4 - 1/9) 13.6 eV = 3.026e-12 erg
  + => EM = 0.001 / (1e-13 / 4 pi) 3.026e-12 = 4.153e22 cm^-5
+ RMS electron density
  + Assume L \approx R = 0.01 pc = 3.086e16 cm
  + n = sqrt(EM / L) = 1160 cm^-3
  + That sounds like a reasonable number, but might imply a small ionizing photon luminosity
    + Q_H = (4 \pi / 3) \alpha_B n^2 R^3 = (4 pi / 3) 2.6e-13 1160**2 (0.01 3.085677582e18)**3 = 4.305e43
    + *This is very faint!*


**** Info from Gaia
+ [[file:1528254812272O-result.json]]
+ Extracted and derived data
  | Quantity        | Unit       |               Value |
  |-----------------+------------+---------------------|
  | source_id       |            | 3017360348171372672 |
  | ra              | deg        |   83.79099195922022 |
  | ra_error        | mas        | 0.04624738839693305 |
  | dec             | deg        |  -5.464774673154743 |
  | dec_error       | mas        | 0.04518707614040293 |
  | parallax        | mas        |   2.447378178564449 |
  | parallax_error  | mas        | 0.06419465488526256 |
  | pmra            | mas.yr**-1 |  1.4821304012919858 |
  | pmra_error      | mas.yr**-1 | 0.11623231572816041 |
  | pmdec           | mas.yr**-1 |  1.6097056019763252 |
  | pmdec_error     | mas.yr**-1 | 0.09540261483321187 |
  | phot_g_mean_mag | mag        |            8.325929 |
  | bp_rp           | mag        |           0.3084631 |
  | a_g_val         | mag        |              0.4895 |
  |-----------------+------------+---------------------|
  | PA of pm        | deg        |        42.6 +/- 2.8 |
  | Total pm        | mas.yr**-1 |       2.19 +/- 0.11 |
  | V(tangential)   | km/s       |         4.2 +/- 0.2 |
  | D               | pc         |      408.6 +/- 10.7 |
  | RA              | hms        |   5@ 35' 9.8380702" |
  | Dec             | hms        |  -5@ 27' 53.188823" |
  #+TBLFM: @16$3=arctan(@9 +/- @10 / @11 +/- @12);f1::@17$3=sqrt((@9 +/- @10)**2 + (@11 +/- @12)**2);f2::@18$3=4.74 @-1 / (@7 +/- @8) ; f1::@19$3=1000/(@7 +/- @8) ; f1::@20$3=hms(@3/15)::@21$3=hms(@5)
+ [X] Check that this is the correct star!
  + 83.79099195922022, -5.464774673154743
    + 5@ 35' 9.8380702"
    + -5@ 27' 53.188823"
    + => 098-753 in OW notation
    + So this is consistent with the Spitzer position
+ So it is moving in roughly the right direction, but very slowly!
+ So, if it is a bow shock it must be an ambient flow - say 20 km/s
***** DONE Optical continuum
CLOSED: [2018-10-31 Wed 22:39]
+ There is a color gradient across the object
  + Redder to the east
  + Almost certainly this is due to reddening from the foreground cloud
+ In principle, we can use the ~PHOTFLAM~ inverse sensitivity to convert from counts/s to something more physical
  + F_{\lambda }= ~PHOTFLAM~ \times \sum pixels
+ Define an ~epandas~ aperture
  + This can remove the star, but has problems with the saturation spikes
  + [ ] Come back to this later
+ ACS bands
  + F850LP
  + F775W
    : PHOTFLAM= 9.94972069999999E-20 / inverse sensitivity, ergs/cm2/Ang/electron     
  + F555W
  + F435W
+ WFPC2 bands
  + F606W
  + F336W
    + PHOTFLAM = 1.115396E-16
+ First we do the epandas region that has the bow and a bit of diffraction spikes
  |    Wav |  PHOTFLAM |      F |     A |    B1 |    B2 |  A_B |     F* |    A* | Fnu               | Fnu*               |
  | micron |           |    e/s |  sqas |   e/s |   e/s | sqas |        |       | Jy                | Jy                 |
  |--------+-----------+--------+-------+-------+-------+------+--------+-------+-------------------+--------------------|
  | 0.3359 | 1.115E-16 |   1510 |   107 |  1024 |  1155 |  142 |  12046 | 43.74 | 0.0289 +/- 0.0021 | 0.4914 +/- 0.0008  |
  |  0.435 | 3.076e-19 | 120496 | 116.3 | 29672 | 56624 |  142 | 587537 | 43.74 | 0.0165 +/- 0.0021 | 0.1115 +/- 0.0008  |
  |  0.555 | 1.931e-19 | 138296 | 116.3 | 42297 | 71316 |  142 | 597109 | 43.74 | 0.0182 +/- 0.0024 | 0.1150 +/- 0.0009  |
  |  0.606 | 1.862e-18 |  19170 |   113 |  7945 | 10729 |  142 |        | 43.74 | 0.0268 +/- 0.0025 | -0.0066 +/- 0.0010 |
  |  0.775 | 9.863e-20 | 107122 | 116.3 | 34400 | 43121 |  142 | 560811 | 43.74 | 0.0149 +/- 0.0007 | 0.1085 +/- 0.0003  |
  |  0.850 | 1.492e-19 |  57396 | 116.3 | 22584 | 27048 |  142 | 473438 | 43.74 | 0.0133 +/- 0.0007 | 0.1675 +/- 0.0002  |
  #+TBLFM: $10=3.3356e12 $1**2 $2 ($3 - ($4/$7) vmeane([$5, $6]));f4::$11=3.3356e12 $1**2 $2 ($8 - ($9/$7) vmeane([$5, $6]));f4
  + With F336W I had to finesse the epanda a bit to avoid a readout spike
  + F606W has a big blank space where the star should be
  + The ~PHOTFLAM~ values were found from
    + https://acszeropoints.stsci.edu/checks1/
    + Using date of 2005-04-11
  + So, with ~PHOTFLAM~ we get to F_{\lambda} in erg/s/cm^2/\AA
  + So to convert it to F_{\nu} in Jy, we need to use
    + F_{\nu} = d\lambda/d\nu F_{\lambda} = F_{\lambda} / (d\nu/d\lambda)
    + d\nu/d\lambda = d/d\lambda (c/\lambda) = c/\lambda^{2}
    + => F_{\nu} = (\lambda^{2}/c) F_{\lambda}
    + 1 erg/s/cm^2/\AA = 1e8 erg/s/cm^2/cm = 3.3356e-11 \lambda_{\micro}^{2 } erg/s/cm^2/Hz = 3.3356e12 \lambda_{\micro}^{2 } Jy
****** DONE Audit of HST photometry
CLOSED: [2018-11-26 Mon 10:29]
+ [2018-11-21 Wed] There is a clear problem with the visual points in the observed SED
  + By comparison with magnitudes from literature, they should be higher by a factor of 10 or so
+ Steps to do
  + [X] Check against 2015 observations
    * ACS F775W, ~jcol19010_drc.fits~
      :                    / PHOTOMETRY KEYWORDS                                             
      : PHOTMODE= 'ACS WFC1 F775W MJD#57235.8664' / observation con                     
      : PHOTFLAM= 9.94972069999999E-20 / inverse sensitivity, ergs/cm2/Ang/electron     
      : PHOTZPT =       -2.1100000E+01 / ST magnitude zero point                        
      : PHOTPLAM=        7.6931802E+03 / Pivot wavelength (Angstroms)                   
      : PHOTBW  =        4.3447256E+02 / RMS bandwidth of filter plus detector
      * This from 2015
      * Use a big circle aperture
        - Total source flux: 2346364.3
        - Total BG flux: -273264.15
        - Yes, that is negative - some problem with the zero point
        - Net source flux: 2619628.45 e/s = 2.58373954024e-13 erg/s/cm2/AA = 0.517 Jy
      * Compare with ~lp-ori-f775w.fits~
        - Seems it is not using native pixels
        - Use circle aperture
          - Total source flux: 1084975.8
          - Total BG flux: 154755.88
          - Net source flux: 930219.92 e/s = 0.1838 Jy
    * WFC3 F139M ~icol04030_drz.fits~
      :               / PHOTOMETRY KEYWORDS                                             
      : PHOTMODE= 'WFC3 IR F139M'      / observation con                                
      : PHOTFLAM=        9.1828299E-20 / inverse sensitivity, ergs/cm2/Ang/electron     
      : PHOTFNU =        5.8651381E-07 / inverse sensitivity, Jy*sec/electron           
      : PHOTZPT =       -2.1100000E+01 / ST magnitude zero point                        
      : PHOTPLAM=        1.3837616E+04 / Pivot wavelength (Angstroms)                   
      : PHOTBW  =        2.7801804E+02 / RMS bandwidth of filter plus detector          
      + The conversion to Jy checks out fine:
        + 3.3356e12 1.38376**2 9.1828299E-20 = 5.86505446698e-7
        + So that isn't where the problem lies
      + But the IR doesn't have such a problem
  + [X] Redo using original [[file:/Volumes/SSD-1TB/OrionTreasury/acs/]] images
    + Make sure to connect esternal disk first
    + Using ~strip1l_f775w~ and small circle (4.3 arcsec radius)
      + PHOTOMETRY KEYWORDS                                             
       : PHOTMODE= 'ACS WFC1 F775W'     / observation con                                
       : PHOTFLAM=        1.0065458E-19 / inverse sensitivity, ergs/cm2/Ang/electron     
       : PHOTZPT =       -2.1100000E+01 / ST magnitude zero point                        
       : PHOTPLAM=        7.6930146E+03 / Pivot wavelength (Angstroms)                   
       : PHOTBW  =        4.3459634E+02 / RMS bandwidth of filter plus detector          
      + Total source flux: 1092808.3
      + BG fluxes: 26089, 33978, 23105, 36157
        + Mean 29832.25 +/- 3115.25
      + Net source flux: 1062976 +/- 3000 e/s = 0.214 Jy - too low!
    + Same with big circle (15 arcsec) - includes saturation spike and shell
      + Total source: 2025509
      + BG: 325640, 356142, 417123, 339335
        + Mean: 359560 +/- 20175
      + Net source: 1665949 +/- 20175 e/s = 0.336 +/- 0.004 Jy
    + We need to take into account of other bleed spike, which goes off the image
      - use a snug circle and a box for the right-hand bleed spike, which we can then double
      - Snug circle (3.8 arcsec):
        - Source: 1024562
        - BG: 27785, 25810, 23921, 16258 = 23443 +/- 2521
        - Net: 1001119 +/- 2521
      - Box for spike (16.79 x 0.88 arcsec)
        - Source: 327695
        - BG: 8938, 7571, 6299, 6189 = 7249 +/- 644
        - Net: 320446 +/- 644
      - So total star is Snug circle plus two times box:
        - 1642011 +/- 2831 e/s = 0.331 Jy
        - This is 3 times higher than I had before, but is a bit smaller than the 0.5-ish that I get from the 2015 observations
      - Also shell plus other stars is Big circle minus (Snug circle plus one times box)
        - 344384 +/- 20342 = 0.069 +/- 0.004 Jy
      - Other stars from tiny circle (0.5 arcsec):
        - Stars: 8276 + 2990 + 3145
        - BG: 1291, 1359, 873, 1172, 620, 758 = 1012 +/- 124
        - Net: Stars minus three times BG = 11375 +/- 372
      - Corrected shell: 333009 +/- 20345 e/s = 0.067 +/- 0.004 Jy
        - Thus is 4.5 times higher than last time - how come?
    + Repeat for all the filters: 
      + Big circle (R=15)
        | Filter |   Source |    BG1 |    BG2 |    BG3 | Net                 |
        |--------+----------+--------+--------+--------+---------------------|
        | F435W  | 2132996. | 524671 | 392794 | 424808 | 1.686e6 +/- 3.971e4 |
        | F555W  | 2290373. | 694532 | 524089 | 533676 | 1.706e6 +/- 5.529e4 |
        | F775W  | 2025509. | 325640 | 356142 | 417123 | 1.659e6 +/- 2.689e4 |
        | F850LP | 1507335. | 274625 | 203363 | 223608 | 1.273e6 +/- 2.120e4 |
        #+TBLFM: $6=$2 - vmeane($3..$5) ; s4
      + Snug circle (3.8 arcsec):
        | Filter |   Source |   BG1 |   BG2 |   BG3 | Net               |
        |--------+----------+-------+-------+-------+-------------------|
        | F435W  | 1068232. | 32951 | 18923 | 33656 | 1.04e6 +/- 4.80e3 |
        | F555W  | 1089523. | 40711 | 26710 | 41979 | 1.05e6 +/- 4.89e3 |
        | F775W  | 1024562. | 27785 | 25810 | 23921 | 9.99e5 +/- 1.12e3 |
        | F850LP |  868698. | 18799 | 14470 | 15875 | 8.52e5 +/- 1.28e3 |
        #+TBLFM: $6=$2 - vmeane($3..$5) ; s3
      + Box for spike
        | Filter |  Source |   BG1 |  BG2 |   BG3 | Net               |
        |--------+---------+-------+------+-------+-------------------|
        | F435W  | 322589. |  9689 | 5065 | 10414 | 3.14e5 +/- 1.68e3 |
        | F555W  | 327436. | 11832 | 7301 | 13187 | 3.17e5 +/- 1.78e3 |
        | F775W  | 327695. |  8938 | 7571 |  6299 | 3.20e5 +/- 7.62e2 |
        | F850LP | 242350. |  4979 | 4058 |  4904 | 2.38e5 +/- 2.95e2 |
        #+TBLFM: $6=$2 - vmeane($3..$5) ; s3
      + Other stars (R=0.5)
        | Filter | Star1 | Star2 | Star3 | BG1a | BG1b | BG2a | BG2b | BG3a | BG3b | Net               |
        |--------+-------+-------+-------+------+------+------+------+------+------+-------------------|
        | F435W  |   926 |   948 |  1619 |  809 |  978 |  835 |  732 | 1778 | 1554 | 1.50e2 +/- 5.39e2 |
        | F555W  |  1152 |  1688 |  1844 | 1006 | 1268 |  866 |  990 | 1734 | 1926 | 7.89e2 +/- 5.34e2 |
        | F775W  |  8276 |  2990 |  3145 | 1291 | 1359 |  873 | 1172 |  620 |  758 | 1.14e4 +/- 3.72e2 |
        | F850LP |  3532 |  8261 |  3870 |  550 |  700 |  446 |  600 |  762 |  731 | 1.38e4 +/- 1.49e2 |
        #+TBLFM: $11=vsum($2..$4) - 3 vmeane($5..$10);s3
      + Star and shell in Jy
        | Filter |  wave |      PHOTFLAM | Big               | Snug              | Box               | Stars             | LP Ori            | Shell           |
        |--------+-------+---------------+-------------------+-------------------+-------------------+-------------------+-------------------+-----------------|
        | F435W  | 0.435 | 3.1412476E-19 | 1.68e6 +/- 3.97e4 | 1.04e6 +/- 4.79e3 | 3.14e5 +/- 1.67e3 | 1.50e2 +/- 5.39e2 | 0.331 +/- 0.001   | 0.065 +/- 0.008 |
        | F555W  | 0.555 | 1.9559270E-19 | 1.70e6 +/- 5.52e4 | 1.05e6 +/- 4.89e3 | 3.16e5 +/- 1.78e3 | 7.89e2 +/- 5.34e2 | 0.338 +/- 0.001   | 0.067 +/- 0.011 |
        | F775W  | 0.775 | 1.0065458E-19 | 1.65e6 +/- 2.68e4 | 9.98e5 +/- 1.11e3 | 3.20e5 +/- 7.62e2 | 1.13e4 +/- 3.72e2 | 0.330 +/- 3.80e-4 | 0.065 +/- 0.005 |
        | F850LP | 0.850 | 1.5074510E-19 | 1.27e6 +/- 2.12e4 | 8.52e5 +/- 1.27e3 | 2.37e5 +/- 2.95e2 | 1.37e4 +/- 1.48e2 | 0.482 +/- 5.09e-4 | 0.061 +/- 0.008 |
        #+TBLFM: $8=3.3356e12 $2**2 $3 ($5 + 2 $6) ;f3::$9=3.3356e12 $2**2 $3 ($4 - $5 - $6 - $7) ;f3
      + Still 4 to 5 times too small - why?
  + [X] Also check the WFC3 IR photometry
    + ~icol04030~
    + ~PHOTMODE= 'WFC3 IR F139M'~
    + ~PHOTFNU =        5.8651381E-07 / inverse sensitivity, Jy*sec/electron~
    + Using circles
      | Region       |  Source |   BG1 |   BG2 | Net flux, Jy        |
      |--------------+---------+-------+-------+---------------------|
      | Circle 15    | 1161104 | 39642 | 42966 | 0.65678 +/- 0.00097 |
      | Circle 1     |  792321 |   815 |   858 | 0.46422 +/- 0.00001 |
      | Inner star 1 |   15813 |  1158 |  1363 | 0.00854 +/- 0.00006 |
      | Inner star 2 |   12432 |   980 |   522 | 0.00685 +/- 0.00013 |
      | Inner star 3 |   23812 |  1545 |  1228 | 0.01315 +/- 0.00009 |
      | Outer star 1 |   20924 |   288 |   371 | 0.01208 +/- 0.00002 |
      #+TBLFM: $5=5.8651381e-07 ($2 - vmeane([$3, $4])) ;f5
    + Inner stars are inside the 15 arcsec source aperture, while outer stars are outside it
      + The BG values for the 15 arcsec circle avoid stars, so the inner stars need subtracting separately
    + In principle this needs an aperture correction for the 1 arcsec apertures
      + According to [[http://www.stsci.edu/hst/wfc3/analysis/ir_ee][this page]] the encircled energy is 0.92 at 1 arcsec
      + Gives total stellar flux of 0.4642/0.92 = 0.505 Jy
      + This is actually a bit less than I got before
    + For outer star 1 (source 3290 from Robberto:2013a), we can convert to magnitudes
      + 1.39 is intermediate between J and H (13/34 = 0.38 of way from 1.26 to 1.6)
      + Assume zero point of 1600 + 0.38 (1080 - 1600) = 1400 Jy
      + Magnitude is 12.66
      + Compare Robberto:2010a : J = 12.66, H = 12.07 - predict m = 12.43
      + Compare Hillenbrand:1998a : J = 12.66, H = 12.08
      + Other catalogs give J = 12.62 to 12.66
      + So, literature is maybe 0.22 mag brighter => factor of 10**(0.4 0.22) = 1.22
    + For the shell, we can approximate as 0.65678 - (0.46422 + 0.00854 + 0.00685 + 0.01315)/0.92 = 0.12 Jy
      + Compare the 0.043 that we got last time - much larger than that!
      + Why? Probably because of a bigger aperture


  + [X] Compare photometry for non-saturated stars with table from Robberto:2013a
    + From Robberto Table 5 (just first visit for each star)
      |   ID |          RA |         Dec |   F435W |   F555W |   F775W |  F850LP |
      |------+-------------+-------------+---------+---------+---------+---------|
      | 3290 | 5:35:10.880 | -5:28:00.76 | 19.0222 | 17.3977 | 14.7463 | 13.7581 |
      | 3086 | 5:35:09.591 | -5:28:00.02 | 20.2658 | 18.7080 | 15.4081 | 14.4585 |
      | 2963 | 5:35:08.344 | -5:27:56.89 | 19.4596 | 17.7425 | 14.9634 | 13.8078 |
    + My measurements at F555W
      |   ID |          RA |         Dec | F555W e/s       | VEGAMAG          | F_\nu, Jy               | JYMAG            |
      |------+-------------+-------------+-----------------+------------------+-----------------------+------------------|
      | 3290 | 5:35:10.880 | -5:28:00.76 | 1924.5 +/- 12.5 | 17.421 +/- 0.007 | 0.000380 +/- 0.000002 | 17.453 +/- 0.006 |
      | 3086 | 5:35:09.588 | -5:28:00.02 | 758.5 +/- 16.5  | 18.432 +/- 0.024 | 0.000150 +/- 0.000003 | 18.463 +/- 0.022 |
      | 2963 | 5:35:08.343 | -5:27:56.89 | 1402 +/- 34     | 17.765 +/- 0.026 | 0.000277 +/- 0.000007 | 17.797 +/- 0.027 |
      #+TBLFM: $5=25.724 - 0.092 - 2.5 log10($4);f3::$6=3.3356e12 0.55**2 1.9559270E-19 $4;f6::$7=-2.5 log10($6/3640);f3::@2$4=2373 - vmeane([436, 461])::@3$4=1686 - vmeane([911, 944])::@4$4=2074 - vmeane([638, 706])
      + ~PHOTZPT = -21.1~
      + ~PHOTFLAM = 1.9559270E-19~
      + Zero point for Vega magnitudes from Sirianni:2005a Table 10: 25.724
        + Not sure why header says something different
      + Aperture correction from Sirianni:2005a: 0.092 mag
      + So Vega magnitudes check out
      + BUT, we still haven't verified the PHOTFLAM value
        + I use the header PHOTFLAM to convert to Jy
        + Jansky zeropoint is supposedly F0 = 3640 Jy for V band
        + Magnitude = -2.5 log10(F / F0), given in JYMAG column above
      + So that checks out too
    + Final check is to find independent measurements of V magnitude of one of these stars
      + Source 3290
        + DaRio:2009a give V = 17.490, which is perfectly consistent
        + Hillenbrand:1997a give V = 17.33, which is close enough (\Delta{}m = 0.16 => 15% brighter)
        + Parihar:2009a give V = 16.28, which is a whole magnitude brighter (factor of 2.5)
  + [X] Is it anything to do with the non-standard gain?
    + Robberto used 2 e/ADU instead of 1 e/ADU, but the header says that the units are electrons, so does this matter?
    + We could use synphot to try and find out
    + Turns out that pysynphot has no "ADC gain" keywords, although other instruments, such as WFPC2, do
    + The agreement of magnitudes for the non-saturated stars, means that this cannot be an issue
***** DONE Near-infrared
CLOSED: [2018-10-31 Wed 18:34]
+ NICMOS observations just miss
+ WFC3 bands
  + F130N
    - narrow-band continuum near Pa\beta
    - \lambda_0 = 1281.8 nm; \Delta\lambda = 15.6 nm
    - icol04020
    - PHOTFLAM=        4.0980456E-19 / inverse sensitivity, ergs/cm2/Ang/electron
    - PHOTFNU =        2.3121822E-06 / inverse sensitivity, Jy*sec/electron 
  + F139M
    - Designed for H2O/CH4 absorption
    - \lambda_0 = 1383.8 nm; \Delta\lambda = 64.3 nm
    - icol04030
    - PHOTFLAM=        9.1828299E-20 / inverse sensitivity, ergs/cm2/Ang/electron
    - PHOTFNU =        5.8651381E-07 / inverse sensitivity, Jy*sec/electron
+ Like with Spitzer, we first do the star
  |    Wav |  PhotFnu |        |        |       |         |      |     |            | F_*               |
  | micron |          |   Core | A_core | Spike | A_spike |  BG1 | BG2 | BG         | Jy                |
  |--------+----------+--------+--------+-------+---------+------+-----+------------+-------------------|
  |   1.30 | 2.312e-6 | 289806 |   53.4 |   698 |    3.49 |  283 | 303 | 293 +/- 10 | 0.6625 +/- 0.0004 |
  |   1.39 | 5.865e-7 | 934675 |   54.6 |  2630 |    3.49 | 1039 | 871 | 955 +/- 84 | 0.5424 +/- 0.0008 |
  #+TBLFM: $9=vmeane([$7, $8]);f0::$10=$2 ($3 - ($4 $9 / $6 ) + 3 ($5 -  $9));f4
  + We just do one spike and multiply by 3 (only 3 diffraction spikes are in source region)
  + The BG boxes are same size as spike box
+ Same, but just the spike
  |    Wav |  PhotFnu |       |      |     |            | F_spike             |
  | micron |          | Spike |  BG1 | BG2 | BG         | Jy                  |
  |--------+----------+-------+------+-----+------------+---------------------|
  |   1.30 | 2.312e-6 |   698 |  283 | 303 | 293 +/- 10 | 0.00281 +/- 0.00007 |
  |   1.39 | 5.865e-7 |  2630 | 1039 | 871 | 955 +/- 84 | 0.00295 +/- 0.00015 |
  #+TBLFM: $6=vmeane([$4, $5]);f0::$7=$2 3 ($3 -  $6);f5
+ Other stars
  |    Wav |  PhotFnu |       |       |      |      |              | F_*               |
  | micron |          | Star1 | Star2 |  BG1 |  BG2 | BG           | Jy                |
  |--------+----------+-------+-------+------+------+--------------+-------------------|
  |   1.30 | 2.312e-6 |  5479 |  3551 |  329 |  432 | 381. +/- 52. | 0.0109 +/- 0.0002 |
  |   1.39 | 5.865e-7 | 24221 | 15955 | 1085 | 1513 | 1299 +/- 214 | 0.0127 +/- 0.0003 |
  #+TBLFM: $7=vmeane([$5, $6]);f0::$8=$2 ($3 - 2 $7);f4
  + Actually, we don't use Star 2 since it is not in the arc source aperture
+ Now, we try the arc + small star + 3 spikes
  |    Wav |  PhotFnu |        |       |      |                  |          |        | F_sum             |
  | micron |          | Source |   BG1 |  BG2 | BG               | A_source |   A_BG | Jy                |
  |--------+----------+--------+-------+------+------------------+----------+--------+-------------------|
  |   1.30 | 2.312e-6 |  34724 |  5558 | 6379 | 5969. +/- 411.   |    268.6 | 142.16 | 0.0542 +/- 0.0018 |
  |   1.39 | 5.865e-7 | 121610 | 13098 | 9273 | 11186. +/- 1913. |    268.6 | 142.16 | 0.0589 +/- 0.0021 |
  #+TBLFM: $6=vmeane([$4, $5]);f0::$9=$2 ($3 - ($6 $7 / $8 ));f4
  + (we have excluded the main star by using the epandas shape)
+ Now, put things together
  |    Wav | F_sum             | F_*               | F_spike             | F_arc             |
  | micron | Jy                | Jy                | Jy                  | Jy                |
  |--------+-------------------+-------------------+---------------------+-------------------|
  |   1.30 | 0.0542 +/- 0.0018 | 0.0109 +/- 0.0002 | 0.00281 +/- 0.00007 | 0.0405 +/- 0.0018 |
  |   1.39 | 0.0589 +/- 0.0021 | 0.0127 +/- 0.0003 | 0.00295 +/- 0.00015 | 0.0433 +/- 0.0021 |
  #+TBLFM: $5=$2 - ($3 + $4) ;f4


***** DONE Spitzer IRAC
CLOSED: [2018-10-31 Wed 12:15]
+ Images are in MJy/sr
  + 1 MJy/sr = 2.3504e-5 Jy/sqas
  + Pixels are 0.6 arcsec => 1 MJy/sr = 8.4616e-6 Jy/pixel
+ First do the star, so we can subtract it
  + Use a circular aperture with radius 2.5 arcsec
  + And two identical ones for the star's BG, which is really the shell!
    + We put it at a similar distance from the shell
    + Because all apertures are the same size, we don't need to use surface brightness at all - everything is fluxes
  |    Wav |  \sum pix | \Sigma bg1 | \Sigma bg2 | BG               | F_*             |
  | micron |        |       |       |                  | Jy              |
  |--------+--------+-------+-------+------------------+-----------------|
  |    3.6 |  34605 |  5655 |  5023 | 5339 +/- 316     | 0.248 +/- 0.003 |
  |    4.5 |  25861 |  5732 |  5467 | 5600. +/- 133.   | 0.171 +/- 0.001 |
  |    5.8 |  46580 | 28076 | 23711 | 25894. +/- 2183. | 0.175 +/- 0.018 |
  |    8.0 | 114441 | 80768 | 69127 | 74948. +/- 5821. | 0.334 +/- 0.049 |
  #+TBLFM: $5=vmeane([$3, $4]);f0::$6=8.4616e-6 ($2 - $5);f3
+ Now, do the nebula plus star using same aperture as for MSX (a bit big, but never mind)
  |    Wav |   \sum pix |     S |    B1 |    B2 | BG             | F_tot            |
  | micron |         |       |       |       |                | Jy               |
  |--------+---------+-------+-------+-------+----------------+------------------|
  |    3.6 |  250842 | 248.8 |  74.2 |  82.9 | 79. +/- 4.     | 1.449 +/- 0.034  |
  |    4.5 |  219439 |   218 |  63.4 |  76.1 | 70. +/- 6.     | 1.261 +/- 0.051  |
  |    5.8 | 1318338 |  1308 | 490.2 | 554.9 | 523. +/- 32.   | 6.695 +/- 0.273  |
  |    8.0 | 3831944 |  3801 |  1497 |  1776 | 1637. +/- 140. | 18.460 +/- 1.194 |
  #+TBLFM: $6=vmeane([$4, $5]);f0::$7=8.4616e-6 $2 ($3 - $6)/$3;f3
  + As with MSX the surface brightness is in funny units, but we only use ratios so it doesn't matter
  + This aperture corresponds to an effective radius of sqrt(A/\pi) = 17.6 arcsec
+ Try also with a tighter aperture, more loke we are going to use for HST images
  |    Wav |   \sum pix |    S |   B1 |   B2 | BG            | F_tot           |
  | micron |         |      |      |      |               | Jy              |
  |--------+---------+------+------+------+---------------+-----------------|
  |    3.6 |   76843 |  330 |  150 |  103 | 127. +/- 24.  | 0.400 +/- 0.047 |
  |    4.5 |   69345 |  298 |  112 |   91 | 102. +/- 11.  | 0.386 +/- 0.022 |
  |    5.8 |  434407 | 1867 |  953 |  698 | 826. +/- 128. | 2.050 +/- 0.252 |
  |    8.0 | 1262209 | 5427 | 2766 | 2088 | 2427 +/- 339  | 5.904 +/- 0.667 |
  #+TBLFM: $6=vmeane([$4, $5]);f0::$7=8.4616e-6 $2 ($3 - $6)/$3;f3
  + In this case, the effective radius is 8.6 arcsec
+ Put it together, taking average of the broad and narrow apertures
  |    Wav | F_narrow |     E | F_broad |     E |   F_* |     E | F_arc            |
  | micron |       Jy |       |      Jy |       |    Jy |       | Jy               |
  |--------+----------+-------+---------+-------+-------+-------+------------------|
  |    3.6 |    0.400 | 0.047 |   1.449 | 0.034 | 0.248 | 0.003 | 0.677 +/- 0.525  |
  |    4.5 |    0.386 | 0.022 |   1.261 | 0.051 | 0.171 | 0.001 | 0.653 +/- 0.438  |
  |    5.8 |    2.050 | 0.252 |   6.695 | 0.273 | 0.175 | 0.018 | 4.198 +/- 2.323  |
  |    8.0 |    5.904 | 0.667 |  18.460 | 1.194 | 0.334 | 0.049 | 11.848 +/- 6.278 |
  #+TBLFM: $8=vmeane([$2, $4]) - ($6 +/- $7) ;f3
  + [ ] *However*, this gives ridiculously large uncertainties, so I may want to revisit
***** DONE Herschel
CLOSED: [2018-10-31 Wed 12:15]
+ 70 micron
  + Source
    + sum: 349.82 Jy
    + area: 368.64 arcsec^2
    + S: 0.949 Jy/arcsec^2
  + BG 1
    + 0.600 Jy/arcsec^2
  + BG 2
    + 0.494 Jy/arcsec^2
+ 160 micron
  + Similar, see table
+ For both wavelengths, we shrink the central hole in the aperture since there is no star emission
|    Wav |      F |       S |      B1 |       B2 | F_B            | F - F_B        |
| micron |     Jy | Jy/sqas | Jy/sqas | Jy/Squas | Jy             | Jy             |
|--------+--------+---------+---------+----------+----------------+----------------|
|     70 |  375.7 |   0.941 |   0.600 |    0.494 | 218.4 +/- 21.2 | 157.3 +/- 21.2 |
|    160 | 155.45 |   0.361 |   0.393 |    0.216 | 131.1 +/- 38.1 | 24.4 +/- 38.1  |
#+TBLFM: $6=($2 / $3) (vmean([$4, $5]) +/- vpsdev([$4, $5])) ;f1::$7=$2 - $6;f1
***** MSX
+ Bands
  |   |      \lambda |     d\lambda |      d\nu |
  |   | micron | micron |      Hz |
  |---+--------+--------+---------|
  | A |   8.28 |   3.36 | 1.47e13 |
  | C |  12.13 |   1.72 | 3.50e12 |
  | D |  14.65 |   2.23 | 3.11e12 |
  | E |  21.34 |   6.24 | 4.11e12 |
#+TBLFM: $4=2.99792458e10 $3 1e-4 / (1e-4 $2)**2;s3
+ d \nu = d \lambda d/d\lambda (c/\lambda) = c d\lambda / \lambda^{2} 
+ Resolution is worse, so we take a slightly larger aperture to avoid losing flux
+ Brightness units are W/m^2/sr over wavelength band
  + 1 W/m^2/sr = 1000/d\nu erg/s/cm^2/sr/Hz = 1e26/d\nu Jy/sr = 2.35e15/d\nu Jy/sqas
    + Check against numbers on [[https://irsa.ipac.caltech.edu/applications/MSX/MSX/imageDescriptions.htm][this page]]
    + For A I get 1 W/m^2/sr = 6.8e12 Jy/sr
    + They get 7.133e12 for a \nu^{-1 }spectrum, which is close enough
  + Pixel size is 6 arcsec
  + => 1 W/m^2/sr = 8.46e16/d\nu Jy/pixel
  + *Note:* The surface brightness values are in strange units, but that does not matter since I only use the ratios BG/Source
|    Wav |      d\nu |        \sum pix |     F |    S |   B1 |   B2 | F_B          | F - F_B       |
| micron |      Hz | W.pix/m^2/sr |    Jy | 1e-6 | 1e-6 | 1e-6 | Jy           | Jy            |
|--------+---------+--------------+-------+------+------+------+--------------+---------------|
|   8.28 | 1.47e13 |     0.002721 |  15.7 | 2.80 | 1.34 | 1.19 | 7.1 +/- 0.4  | 8.6 +/- 0.4   |
|  12.13 | 3.50e12 |    0.0009256 |  22.4 | 0.95 | 0.56 | 0.44 | 11.8 +/- 1.4 | 10.6 +/- 1.4  |
|  14.65 | 3.11e12 |     0.001017 |  27.7 | 1.05 | 0.40 | 0.33 | 9.6 +/- 0.9  | 18.1 +/- 0.9  |
|  21.34 | 4.11e12 |      0.01026 | 211.2 | 10.6 | 2.55 | 2.22 | 47.5 +/- 3.3 | 163.7 +/- 3.3 |
#+TBLFM: $4=$3 8.46e16/$2 ;f1::$8=($4 / $5) (vmean([$6, $7]) +/- vpsdev([$6, $7])) ;f1::$9=$4 - $8;f1
***** LP Ori magnitudes from literature
:PROPERTIES:
:ID:       CEB4DBF1-0986-46BA-BE41-00678A1E47AE
:END:
+ Includes values from [[http://simbad.u-strasbg.fr/simbad/sim-id?Ident=LP+Ori&NbIdent=1&Radius=2&Radius.unit=arcmin&submit=submit+id][SIMBAD]]
  + I gave an uncertainty of 0.05 mag to values with no stated errors
+ Jansky zero points F_0 are taken from
  + https://www.astro.umd.edu/~ssm/ASTR620/mags.html
  + F_{0} is flux density for magnitude of zero
  + F / F_{0} = 10^{-0.4 m}
+ Filter band widths from http://ulisse.pd.astro.it/Astro/ADPS/ADPS2/FileHtml/index_f033.html

| Band |   \lambda_{0} |   d\lambda |   F_{0} |    Mag |   dMag | F               |
|      |   \micro{}m |   \micro{}m |   Jy |        |        | Jy              |
|------+------+------+------+--------+--------+-----------------|
| U    | 0.36 | 0.06 | 1810 |   8.00 |   0.05 | 1.14 +/- 0.05   |
| B    | 0.44 | 0.09 | 4260 |   8.58 |   0.05 | 1.58 +/- 0.07   |
| G    | 0.52 | 0.08 | 3730 | 8.3259 | 0.0006 | 1.74 +/- 9.6e-4 |
| V    | 0.55 | 0.08 | 3640 |   8.46 |   0.05 | 1.50 +/- 0.07   |
| R    | 0.64 | 0.19 | 3080 |   8.19 |   0.05 | 1.63 +/- 0.08   |
| I    | 0.85 | 0.22 | 2550 |  7.980 |   0.05 | 1.64 +/- 0.08   |
| J    | 1.26 | 0.30 | 1600 |  7.743 |  0.024 | 1.28 +/- 0.03   |
| H    | 1.60 | 0.23 | 1080 |  7.636 |  0.047 | 0.95 +/- 0.04   |
| K    | 2.22 | 0.54 |  670 |  7.472 |  0.020 | 0.69 +/- 0.01   |
| L    | 3.45 | 0.86 |  290 |   7.40 |    0.1 | 0.32 +/- 0.03   |
#+TBLFM: $7=$4 10**(-0.4 ($5 +/- $6));f2


Version suitable for reading with python

#+name: lp-ori-magnitudes
| Band |    wav |  dwav |     F |      dF |
|------+--------+-------+-------+---------|
|      | 0.1150 | 0.006 | 0.882 |   0.088 |
|      | 0.1200 | 0.003 | 0.480 |   0.096 |
|      | 0.1220 | 0.003 | 0.099 |    0.09 |
|      | 0.1250 | 0.003 | 0.625 |   0.104 |
|      |  0.140 |  0.02 | 1.569 |   0.131 |
|      |  0.160 |  0.02 | 1.451 |   0.087 |
|      | 0.1800 |  0.02 | 1.405 |   0.108 |
|      | 0.2000 |  0.02 | 0.801 |   0.018 |
|      | 0.2100 |  0.02 | 0.588 |   0.014 |
|      | 0.2257 |  0.02 | 0.508 |   0.010 |
|      |  0.306 |  0.02 | 0.954 |   0.012 |
| U    |  0.365 | 0.066 |  1.14 |    0.05 |
| B    |   0.44 |  0.22 |  1.58 |    0.07 |
| G    |   0.52 |  0.14 |  1.74 | 0.00096 |
| V    |   0.55 |  0.16 |  1.50 |    0.07 |
| R    |   0.64 |  0.23 |  1.63 |    0.08 |
| I    |   0.79 |  0.19 |  1.28 |    0.03 |
| J    |   1.26 | 0.213 |  1.28 |    0.03 |
| H    |   1.60 | 0.307 |  0.95 |    0.04 |
| K    |   2.22 | 0.390 |  0.69 |    0.01 |
| L    |   3.45 | 0.472 |  0.32 |    0.03 |
***** Hayward:1994b
|   wav | peak mJy/arcsec^2 | BG             | GJy/sr        | BG GJy/sr     |
|-------+-------------------+----------------+---------------+---------------|
|  7.58 |               300 | 30 +/- 100     | 11. +/- 4.    | 1. +/- 4.     |
|  8.21 |               528 | 60 +/- 100     | 20. +/- 4.    | 3. +/- 4.     |
|  9.48 |              1990 | 250 +/- 100    | 74. +/- 4.    | 11. +/- 4.    |
| 10.48 |              2630 | 320 +/- 150    | 98. +/- 6.    | 14. +/- 6.    |
| 11.40 |              2325 | 300 +/- 100    | 86. +/- 4.    | 13. +/- 4.    |
| 12.43 |              2050 | 360 +/- 150    | 72. +/- 6.    | 15. +/- 6.    |
|-------+-------------------+----------------+---------------+---------------|
| 15.69 |              8000 | 1000 +/- 3000  | 298. +/- 128. | 43. +/- 128.  |
| 17.37 |              9000 | 1500 +/- 500   | 319. +/- 21.  | 64. +/- 21.   |
| 19.62 |             12750 | 2500 +/- 1000  | 436. +/- 43.  | 106. +/- 43.  |
| 21.42 |             13000 | 4000 +/- 1000  | 383. +/- 43.  | 170. +/- 43.  |
| 22.82 |             14500 | 5000 +/- 5000  | 404. +/- 213. | 213. +/- 213. |
| 24.30 |             20900 | 5000 +/- 10000 | 676. +/- 425. | 213. +/- 425. |
#+TBLFM: $4=1e-3 42.54 ($2 - $3);f0::$5 = 1e-3 42.54 $3;f0

+ 1 mJy/arcsec^2 = 42.54 MJy/sr = 0.04254 GJy/sr
+ 1 MJy/sr = 0.0235 mJy/arcsec^2
+ 1 arcsec^2 = 2.35043863818e-11 sr = 0.0235 nsr or nano-steradian
+ The 24.30 map is very noisy and the highest contour is possibly spurious - I am going to take the second contour, so 1.414 times less than 29500
+ In Fig 4 Hayward:1994b has I_\lambda in units of
  + erg /cm^2 /s /micron /arcsec^2
  + In CGS I_\nu = I_\lambda d\lambda/d\nu
  + d\lambda/d\nu = c / \nu^2 = \lambda^2 / c
  + I_\nu (erg /cm^2 /s /Hz /arcsec^2) = 3.336e-19n (\lambda_\micro)^2 I_\lambda (erg /cm^2 /s /cm /arcsec^2) = 3.336e-15 (\lambda_\micro)^2 I_\lambda (erg /cm^2 /s /micron /arcsec^2)
  + I_\nu (Jy/arcsec^2) = 3.336e8 (\lambda_\micro)^2 I_\lambda
  + I_\nu (GJy/sr) = 42.54 3.336e8  (\lambda_\micro)^2 I_\lambda = 1.419e10 (\lambda_\micro)^2 I_\lambda
+ Take the 10.48 micron point from Fig 4:
  + I_\lambda = 1e-10 erg /cm^2 /s /micron /arcsec^2
  + => I_\nu = 1.419 10.48**2 = 155.85 GJy/sr
  + Whereas I had 98, so need a correction factor of 1.5
  + We will apply that to all the short wavelengths, meaning effective area A = 0.788 1.5 = 1.182 nsr
+ Now the 19.62 micron point as representative of the long ones
  + I_\lambda = 1e-10 erg /cm^2 /s /micron /arcsec^2
  + => I_\nu = 1.419 19.62**2 = 546.23 GJy/sr
  + Whereas I had 436, so correction factor of 1.253
  + So use A = 0.788 1.253 = 0.987


***** IRAC
+ At the short wavelengths, the dominant background is the PSF of the star
+ I use the Smith:2005a image to define the position to take the maximum
+ Then reflect the far-side half of the PSF to give estimate of what should be subtracted
+ For 5.8, the PSF and the nebular backgrounds are roughly equal contributions
+ For 8.0, fluctuations in the nebula dominate uncertainty in the BG


| Wav |  peak | BG            | GJy/sr        | True BG |
|-----+-------+---------------+---------------+---------|
| 3.6 |  2450 | 1000 +/- 200  | 1.45 +/- 0.2  |         |
| 4.5 |  3760 | 1360 +/- 200  | 2.4 +/- 0.2   |         |
| 5.8 |  7826 | 3400 +/- 600  | 4.426 +/- 0.6 |         |
| 8.0 | 22600 | 6000 +/- 2000 | 16.6 +/- 2    |         |
#+TBLFM: $4=($2 - $3)/1000
Hurray, the 8.0 velue slots right in between 7.58 and 8.21 from Hayward

***** Sofia - Shuping:2012a
+ For this I have converted scanned figures to FITS
+ Measurements are in Jy/pix
  + pixel is 0.768 arcsec
  + So 1 Jy/pixel = 1.695 Jy/arcsec^2 = 1.695 42.54 GJy/sr = 72.1 GJy/sr

|  Wav | peak | BG            | GJy/sr         | BG GJy/sr      |
|------+------+---------------+----------------+----------------|
|  7.7 | 0.19 | 0.09 +/- 0.04 | 7.2 +/- 2.9    | 6.5 +/- 2.9    |
| 19.7 |  5.5 | 1.25 +/- 0.75 | 306.4 +/- 54.1 | 90.1 +/- 54.1  |
| 37.1 |  6.0 | 3.7 +/- 0.3   | 165.8 +/- 21.6 | 266.8 +/- 21.6 |
#+TBLFM: $4=72.1 ($2 - $3);f1::$5=72.1 $3;f1


***** UKIRT MAX - Robberto:2005a
:PROPERTIES:
:ID:       CEC2E640-8DFC-4CE8-AE69-513510017BE1
:END:
+ Using the profiles from Fig 14 of Robberto:2005a, and comparing with "counts" in the FITS file ~10_wjh_hdr.fits~
  + 100 is 0.11 Jy/pix
  + 300 is 0.34 Jy/pix
  + Implying my units are mJy/pixel - hurray!
+ Pixel size is 0.26 arcsec
  + 1 Jy/pixel is 14.79 Jy/arcsec^2 = 14.79 42.54 GJy/sr = 629.2 GJy/sr
  + 1 mJy/pixel is 0.6292 GJy/sr
+ 20 micron is more problematic
  + BN/KL has peak of around 9 in my fits file ~20_hdr.fits~ and 11702 in ~10_wjh_hdr.fits~
    + From Robberto:2005a Fig 8 that should be 200 Jy/arcsec^2 at 20 micron and the same at 10 micron
    + So it would make sense if the 20 map were in Jy/pix
  + IRC4 has peak of 6 at 20 micron and 400 at 10 micron
    + So that should be 0.4 14.79 = 5.9 Jy/arcsec^2 at 10 micron
      + Given as 4.76 in Table 4 - close enough!
    + And should be 6 14.79 = 88.74 at 20 micron
      + Given as 101 in Table 4 - again close enough
  + So we just multiply all ~20_hdr.fits~ by 1000 to get them in mJy/pix
+ Filter widths
  : For an A0 V star, the N-band filter has an effective wavelength \lambda_{10} =  10.1 \micro{}m and \Delta\lambda = 3.13 \micro{}m, whereas the Q-band filter has \lambda_{20} = 19.7 \micro{}m and \Delta\lambda = 2.44 \micro{}m.
|  Wav | peak, mJy/pix | BG         | GJy/sr         | BG GJy/sr      |
|------+---------------+------------+----------------+----------------|
| 10.1 |           300 | 110 +/- 30 | 131.5 +/- 20.8 | 76.1 +/- 20.8  |
| 19.7 |           610 | 370 +/- 40 | 166.1 +/- 27.7 | 256.0 +/- 27.7 |
#+TBLFM: $4=0.692 ($2 - $3);f1::$5=0.692 $3;f1

+ Doing Epandas ellipse photometry at 10.1 microns
  + Total flux: (96141.966 + 77094.644)/1000 = 173.2 Jy
    + That is very close to the T-ReCS value at 11.7, but the BG values are very different
    + Area 1052 pixels = 74.83 arcsec^2
      + I don't understand why this is slightly smaller area than with T-ReCS, given that I copied the region over - but never mind
  + Box for BG, same as T-ReCS:
    + 1.499 +/- 6% Jy/arcsec^2
    + 112 Jy in the Epandas aperture, which is enormous
    + The problem here is that there is a glow underneath the MAX observations, and this BG box is right on its maximum - need to find a region that is more representative of the glow underneath th1D
      + This gives me 1.085 +/- 5% Jy/arcsec^2
      + Or 81.2 Jy in aperture, which seems about right, but I would put up the error to +/- 10
  + So BG-subtracted flux is
    + 173.2 - (81.2 +/- 10) = 92. +/- 10 Jy
  + Matching that to the peak-intensity derived fluxes, then implies an effective area of 92./131.5 = 0.70 nsr, which is like what we had anyway
+ Repeat but for 19.7 micron
  + Total flux: 263.30496 + 272.37955 = 535.68 Jy
  + BG box: 4.96 Jy/arcsec^2 +/- 3%
    + 371 +/- 11 Jy in source aperture
  + BG-subtracted flux is
    + 535.68 - (371 +/- 11) = 164.68 +/- 11
  + Matching to peak-intensity derived fluxes:
    + effective area of 165/166.1 = 0.99 nsr,
***** Herschel
+ Amazingly, it is detected at 70 micron
+ Herschel maps are in Jy/pixel, where pixel is 3.2 arcsec (160) or 1.6 arcsec (70 micron)
  + 1 Jy/pixel = 16.62 GJy/sr @ 70 micron
  + 1 Jy/pixel = 4155 MJy/sr = 4.155 GJy/sr @ 150 micron
  + 1 Jy/pixel @ 70 micron = 0.178 erg/s/cm^2/sr
| Wav | pix |  peak | BG           | GJy/sr       | BG GJy/sr     |
|-----+-----+-------+--------------+--------------+---------------|
|  70 | 1.6 | 12.45 | 11.8 +/- 0.1 | 10.8 +/- 1.7 | 196.1 +/- 1.7 |
| 160 | 3.2 |  12.5 | 12.5 +/- 1.0 | 0.0 +/- 4.2  | 51.9 +/- 4.2  |
#+TBLFM: $5= 1e-9 (206265/$2)**2  ($3 - $4);f1::$6=1e-9 (206265/$2)**2 $4;f1
***** TODO MSX
+ Take measurements in the same epanda aperture
  + Or not - best try something simpler
+ Use identical apertures for source and BG, so we only need deal in fluxes
+ First with small aperture, R=5.9 arcsec, that encloses all the shell in the high-resolution images (e.g., Smith:2005a)
  | Band |    Wav |      d\nu | \sum pix source |    \sum pix BG1 |    \sum pix BG2 | F              |
  |      | micron |      Hz | W.pix/m^2/sr |              |              | Jy             |
  |------+--------+---------+--------------+--------------+--------------+----------------|
  | A    |   8.28 | 1.47e13 | 0.0090434998 | 0.0063631881 | 0.0023458055 | 27.0 +/- 11.6  |
  | C    |  12.13 | 3.50e12 |  0.005258022 | 0.0024077308 | 0.0014910408 | 80.0 +/- 11.1  |
  | D    |  14.65 | 3.11e12 | 0.0077382821 |  0.005384993 | 0.0028535342 | 98.4 +/- 34.4  |
  | E    |  21.34 | 4.11e12 |  0.039270097 |  0.033553954 |  0.030547993 | 148.6 +/- 30.9 |
  #+TBLFM: $7=($4 - vmeane([$5, $6])) 8.46e16/$3 ;f1
  + Problem is that there will be a significant aperture correction
    + Aperture is 33cm, so PSF width, assume 1.22 \lambda/D
      | Band |    Wav |     \Delta\theta |
      |      | micron | arcsec |
      |------+--------+--------|
      | A    |   8.28 |    6.3 |
      | C    |  12.13 |    9.2 |
      | D    |  14.65 |   11.2 |
      | E    |  21.34 |   16.3 |
      #+TBLFM: $3=206265 1.22 $2 $micron / 33;f1
+ So we should really have a 15 arcsec aperture
  | Band |    Wav |      d\nu | \sum pix source |   \sum pix BG1 |   \sum pix BG2 | F               |
  |      | micron |      Hz | W.pix/m^2/sr |             |             | Jy              |
  |------+--------+---------+--------------+-------------+-------------+-----------------|
  | A    |   8.28 | 1.47e13 |  0.033422338 | 0.021788697 | 0.027468834 | 50.6 +/- 16.3   |
  | C    |  12.13 | 3.50e12 |  0.021263304 | 0.015472882 | 0.011877256 | 183.4 +/- 43.5  |
  | D    |  14.65 | 3.11e12 |  0.031793218 | 0.019560823 | 0.027564799 | 223.9 +/- 108.9 |
  | E    |  21.34 | 4.11e12 |   0.16660307 |  0.12779639 |  0.16597013 | 405.9 +/- 392.9 |
  #+TBLFM: $7=($4 - vmeane([$5, $6])) 8.46e16/$3 ;f1
+ *CONCLUSION* Probably not worth including the MSX results, since the low resolution and confusion/crowding combine to make them unreliable

***** th1D stellar magnitudes from the literature
+ Modelled on [[id:CEB4DBF1-0986-46BA-BE41-00678A1E47AE][LP Ori magnitudes from literature]]
+ Values come from Vizier tables for the most part
+ HD 37023 is th1D

| Reference         | Band   |   \lambda_{0} |    d\lambda |    F_{0} |   Mag |  dMag | F             |
|                   |        |   \micro{}m |    \micro{}m |    Jy |       |       | Jy            |
|-------------------+--------+------+-------+-------+-------+-------+---------------|
| Morell:1978a      | U      | 0.36 |  0.06 |  1810 |  5.96 |  0.05 | 7.48 +/- 0.34 |
| Morell:1978a      | B      | 0.44 |  0.09 |  4260 |  6.78 |  0.05 | 8.27 +/- 0.38 |
| Morell:1978a      | V      | 0.55 |  0.08 |  3640 |  6.70 |  0.05 | 7.61 +/- 0.35 |
| Morell:1978a      | R      | 0.64 |  0.19 |  3080 |  6.40 |  0.02 | 8.48 +/- 0.16 |
| Morell:1978a      | I      | 0.85 |  0.22 |  2550 |  6.21 |  0.02 | 8.37 +/- 0.15 |
| Mermilliod:1987a  | U      | 0.36 |  0.06 |  1810 |  5.97 |  0.10 | 7.41 +/- 0.68 |
| Hoffleit:1991a    | B      | 0.44 |  0.09 |  4260 |  6.79 |  0.05 | 8.19 +/- 0.38 |
| GAIA DR2          | G      | 0.52 |  0.08 |  3730 |  6.56 |  0.02 | 8.87 +/- 0.16 |
| Hillenbrand:1997a | V      | 0.55 |  0.08 |  3640 |  6.70 |  0.05 | 7.61 +/- 0.35 |
| Hillenbrand:1997a | I      | 0.85 |  0.22 |  2550 |  6.30 |  0.05 | 7.70 +/- 0.35 |
| Robberto:2010a    | J      | 1.26 |  0.30 |  1600 | 7.146 |  0.02 | 2.22 +/- 0.04 |
| Robberto:2010a    | H      | 1.60 |  0.23 |  1080 | 5.891 | 0.053 | 4.75 +/- 0.23 |
| Robberto:2010a    | K      | 2.22 |  0.54 |   670 | 5.751 | 0.027 | 3.35 +/- 0.08 |
| Hillenbrand:1998a | J      | 1.26 |  0.16 |  1600 |  6.01 |  0.05 | 6.31 +/- 0.29 |
| Hillenbrand:1998a | H      | 1.60 |  0.30 |  1080 |  5.84 |  0.05 | 4.98 +/- 0.23 |
| Hillenbrand:1998a | K      | 2.22 |  0.54 |   670 |  5.69 |  0.05 | 3.55 +/- 0.16 |
| Hillenbrand:1998a | L      | 3.45 |  0.86 |   290 |  5.70 |  0.05 | 1.52 +/- 0.07 |
| Megeath:2012a     | IRAC 1 |  3.6 |  0.75 | 280.9 |   5.5 |   0.1 | 1.77 +/- 0.16 |
| Megeath:2012a     | IRAC 2 |  4.5 | 1.015 | 179.7 |  4.97 |   0.1 | 1.85 +/- 0.17 |
| Megeath:2012a     | IRAC 3 |  5.8 | 1.425 | 115.0 |  4.24 |   0.1 | 2.32 +/- 0.21 |
#+TBLFM: $8=$5 10**(-0.4 ($6 +/- $7));f2
 
Not used since no Jy zero points
| Paunzen:2015a | u |  0.35 |  0.03 |   | 8.083 |      | 0.00 |
| Paunzen:2015a | v | 0.411 | 0.019 |   | 7.985 |      | 0.00 |
| Paunzen:2015a | b | 0.467 | 0.018 |   | 6.836 |      | 0.00 |
| Paunzen:2015a | y | 0.547 | 0.023 |   |  6.71 | 0.05 | 0.00 |


+ Version suitable for reading with python
  + Combines above with IUE from below
  + and the Smith:2005a value too

#+name: th1d-magnitudes
| Band   |  wav |  dwav |    F |   dF |
|--------+------+-------+------+------|
| U      | 0.36 |  0.06 | 7.48 | 0.34 |
| B      | 0.44 |  0.09 | 8.27 | 0.38 |
| V      | 0.55 |  0.08 | 7.61 | 0.35 |
| R      | 0.64 |  0.19 | 8.48 | 0.16 |
| I      | 0.85 |  0.22 | 8.37 | 0.15 |
| U      | 0.36 |  0.06 | 7.41 | 0.68 |
| B      | 0.44 |  0.09 | 8.19 | 0.38 |
| G      | 0.52 |  0.08 | 8.87 | 0.16 |
| V      | 0.55 |  0.08 | 7.61 | 0.35 |
| I      | 0.85 | 0.221 | 7.70 | 0.35 |
| H      | 1.60 |  0.23 | 4.75 | 0.23 |
| K      | 2.22 |  0.54 | 3.35 | 0.08 |
| J      | 1.26 |  0.30 | 6.31 | 0.29 |
| H      | 1.60 |  0.23 | 4.98 | 0.23 |
| K      | 2.22 |  0.54 | 3.55 | 0.16 |
| L      | 3.45 |  0.86 | 1.52 | 0.07 |
| IRAC 1 |  3.6 |  0.75 | 1.77 | 0.16 |
| IRAC 2 |  4.5 | 1.015 | 1.85 | 0.17 |
| IRAC 3 |  5.8 | 1.425 | 2.32 | 0.21 |
| N      | 11.7 |  1.11 | 0.06 | 0.01 |

******* Measurements from Bohlin:1981a

#+name: bohlin-iue-th1d
| Wav (Ang) | Flam/1e-11 | Fnu (Jy) |
|-----------+------------+----------|
|      1200 |       13.3 |    6.388 |
|      1225 |       9.24 |    4.625 |
|      1250 |       27.6 |   14.385 |
|      1275 |       33.1 |   17.948 |
|      1300 |       31.4 |   17.701 |
|      1325 |       33.4 |   19.559 |
|      1350 |       29.2 |   17.751 |
|      1375 |       27.8 |   17.532 |
|      1400 |       22.0 |   14.383 |
|      1425 |       24.2 |   16.392 |
|      1450 |       23.8 |   16.691 |
|      1475 |       22.8 |   16.546 |
|      1500 |       21.7 |   16.286 |
|      1525 |       19.3 |   14.972 |
|      1550 |       14.9 |   11.941 |
|      1575 |       16.4 |   13.570 |
|      1600 |       15.4 |   13.150 |
|      1625 |       14.3 |   12.596 |
|      1650 |       14.2 |   12.895 |
|      1675 |       13.7 |   12.821 |
|      1700 |       13.4 |   12.917 |
|      1725 |       12.5 |   12.407 |
|      1750 |       12.7 |   12.973 |
|      1775 |       12.1 |   12.716 |
|      1800 |       11.5 |   12.428 |
|      1825 |       11.3 |   12.554 |
|      1850 |       10.1 |   11.530 |
|      1875 |       9.48 |   11.117 |
|      1900 |       8.81 |   10.609 |
|      1925 |       7.51 |    9.283 |
|      1925 |       8.49 |   10.494 |
|      1950 |       8.19 |   10.388 |
|      1975 |       7.28 |    9.472 |
|      2000 |       7.26 |    9.687 |
|      2025 |       6.64 |    9.082 |
|      2050 |       6.33 |    8.873 |
|      2075 |       5.75 |    8.258 |
|      2100 |       5.42 |    7.973 |
|      2125 |       5.10 |    7.682 |
|      2150 |       4.86 |    7.494 |
|      2175 |       4.46 |    7.038 |
|      2200 |       4.56 |    7.362 |
|      2225 |       4.32 |    7.134 |
|      2250 |       4.22 |    7.126 |
|      2275 |       4.41 |    7.613 |
|      2300 |       4.28 |    7.552 |
|      2325 |       4.57 |    8.240 |
|      2350 |       4.36 |    8.031 |
|      2375 |       4.44 |    8.354 |
|      2400 |       4.51 |    8.665 |
|      2425 |       4.49 |    8.807 |
|      2450 |       4.63 |    9.270 |
|      2475 |       4.41 |    9.011 |
|      2500 |       4.34 |    9.048 |
|      2525 |       4.31 |    9.166 |
|      2550 |       4.32 |    9.370 |
|      2575 |       4.29 |    9.488 |
|      2600 |       4.07 |    9.177 |
|      2625 |       4.04 |    9.286 |
|      2650 |       4.02 |    9.417 |
|      2675 |       3.78 |    9.022 |
|      2700 |       3.60 |    8.754 |
|      2725 |       3.57 |    8.843 |
|      2750 |       3.57 |    9.005 |
|      2775 |       3.51 |    9.016 |
|      2800 |       3.48 |    9.101 |
|      2825 |       3.32 |    8.838 |
|      2850 |       3.30 |    8.941 |
|      2875 |       3.27 |    9.016 |
|      2900 |       3.15 |    8.837 |
|      2925 |       3.25 |    9.275 |
|      2950 |       3.16 |    9.173 |
|      2975 |       3.02 |    8.916 |
|      3000 |       2.95 |    8.856 |
|      3025 |       2.83 |    8.638 |
|      3050 |       2.72 |    8.440 |
|      3075 |       2.69 |    8.484 |
|      3100 |       2.63 |    8.430 |
|      3125 |       2.60 |    8.469 |
|      3150 |       2.43 |    8.043 |
|      3175 |       2.38 |    8.003 |
|      3200 |       2.39 |    8.163 |
#+TBLFM: $3=33356 $1**2 1e-11 $2;f3

+ Re-check conversion:
  + F_\nu = d\lambda/d\nu = F_\lambda / d\nu/d\lambda = (\lambda^2 / c) F_\lambda
  + With \lambda in \AA, conversion factor from \AA^{-1} to Hz^{-1 }is:
    + (\lambda**2 1e-8**2/ 2.99792458e10) / 1e-8 = 3.336e-19 \lambda**2
  + Then divide by another 1e-23 to put it in Jy
  + => 33360. as expected (1e8 times smaller than the version with microns)

**** Infrared SED of inner shell
+ Ochsendorf:2015a Fig 4e shows the SED
  + But it is I_\nu in MJy/sr, whereas we want to convert it to L_\odot
+ Half power contour is roughly 60 x 180 arcsec (diameters)
  + Area of pi 60 180 / 4 = 8480 square arcsec = 200 nsr (nanosteradian) = 0.2 msr (millisteradian)
+ So multiply I_\nu in MJy/sr by \Omega in msr to get F_\nu in Jy
+ To get SED in erg/cm^2/s, it is 2.9979e-9 F_\nu(Jy) / \lambda(micron)
+ For luminosity, multiply by 4 \pi D^2 = 2.011e43 @ 410 pc
  + Or 5.2652e9 to give L_\odot
+ So, to get \nu L_\nu SED in L_\odot it is 15.78 I_\nu \Omega / \lambda 
+ Now include the measured SEDs, subtracting the region 4 values
  |    wav | IDW Fnu   | BG Fnu      | nuLnu         |
  | micron | MJy/sr    | MJy/sr      | Lsun          |
  |--------+-----------+-------------+---------------|
  |     12 | 12 +/- 8  | 0 +/- 1     | 3.2 +/- 2.1   |
  |     14 | 20 +/- 4  | 0 +/- 1     | 4.5 +/- 0.9   |
  |     20 | 30 +/- 3  | 2 +/- 1     | 4.4 +/- 0.5   |
  |  23.68 | 55 +/- 5  | 2.0 +/- 0.3 | 7.1 +/- 0.7   |
  |     70 | 90 +/- 20 | 25 +/- 5    | 2.9 +/- 0.9   |
  |    160 | 40 +/- 10 | 28 +/- 5    | 0.2 +/- 0.2   |
  |    250 | 26 +/- 4  | 25 +/- 8    | 1e-2 +/- 0.1  |
  |    350 | 15 +/- 3  | 10 +/- 2    | 5e-2 +/- 3e-2 |
  |    500 | 6 +/- 1   | 4.5 +/- 0.5 | 9e-3 +/- 7e-3 |
#+TBLFM: $4=15.78 0.2 ($2 - $3) / $1 ;f1
+ Note that 12, 14, 20 points are from the region 7 spectra but multiplied by 4
  + Since we have no mid-IR spectra for the IDW aperture
+ So, not looking good for RBW!
  + We need 400 Lsun, looks like we get about 15 Lsun
+ Do my own measurements from the MIPS and IRAC maps (already in MJy/sr)
  + MIPS 23.68 micron
    + Median zodiacal light is 23.31573
    + Lowest level is about 30, so zodiacal dominates there, but it doesn't matter since we are always subtracting the BG anyway
    + Peak brightness method
      + Peak is 120, mean BG is 32, so 120 - 32 = 88
      + So half power contour at 32 + 44 = 76
      + This makes almost no difference to the measured size, so still 0.2 msr
      + But with the higher peak we now get 15.78 0.2 88 / 23.68 = 11.7 Lsun
    + Flux method, using various boxes
      | Box       |     Sum |  npix |   Mean |  nuLnu |
      |-----------+---------+-------+--------+--------|
      | Arc       | 3071157 | 76715 |  40.03 | 288.54 |
      | BG        | 2597091 | 77050 |  33.71 | 244.05 |
      | Star      |  102076 |   600 | 170.13 |   9.59 |
      | Arc tight |  647089 | 10354 |  62.50 |  60.80 |
      | BG tight  |  369916 | 10584 |  34.95 |  34.76 |
      #+TBLFM: $4=$2/$3;f2::$5=15.78  $4 1.41e-4 $3 / 23.68 ;f2
      - Each pixel is 2.45 arcsec => 1.41e-4 msr
      - So this gives a shell luminosity of 288.54 - 244.05 - 9.59 = 34.9 Lsun
      - Three times bigger than the peak brightness method, but is including dust that has not been decelerated yet
      - Taking tighter boxes gives 60.80 - 34.76 - 9.59 = 16.45 which is much closer
      - Tight box is 1.46 msr (4 arcmin) and wide box is 10.8 msr (11 arcmin)
  + IRAC 8 micron (actually 7.872)
    + Peak brightness method
      + Peak is 8 (excluding apparent jet)
        + This is actually hard to measure - may be overestimated - more like 7.4 immediately to E of star
      + Mean BG is 6.4 => half power contour = 7.2
      + Net peak is 8 - 6.4 = 1.6
      + SED is 15.78 0.2 1.6 / 7.872 = 0.64 Lsun
      + So far below the 24 micron value
    + No point to flux method here, since it will be too hard to subtract out the stars and jets and the like
  + Other IRAC bands are negligible
+ Do my own measurements with the WISE 
    

**** \sigma Ori proplyd
+ \sigma Ori IRS1 B
+ See Hodapp:2009a and van-Loon:2003a
+ This is very close to the Aa/Ab/B triple
  + 3.5 arcsec in projection => 2e16 cm = 0.007 pc (20 times smaller than inner radius of inner arc)
+ I-front radius is about 40 mas = 2.45e14 cm = 16 AU *very small*
+ Ha emission
  - Hodapp:2009a measure it as 4.7 e−15 W/m^2 = 4.7e-12 erg/cm^2/s
    - Ha energy is 13.6 (1/4 - 1/9) eV = 3.026e-12 erg
    - F = 1.55 phot/cm^2/s
  - We can convert this into an VEM, n^2 h R^2, assuming no extinction
    - Assuming F = pi \alpha_eff \omega R^3 n^2 / 4 pi D^2
    - With \omega = 0.1 and \alpha_eff = 1e-13
    - => n = 2 D sqrt(F / \alpha_eff \omega R^3) = 8.2e6 pcc
  - Or compare with Odell:1998a values for Orion proplyds
    - The distance is the same 410 pc within the errors, so no correction there
    - I /think/ that the fluxes in Bob's Table 1 are extinction corrected, but I am not entirely sure
      - *Update* Now, I think they are not - so should be multiplied by about 2.6 to 3.6, for C(Hb) in range 0.6 to 0.8
    - These are very comparable
    - Proplyds with separations 7 to 30 arcsec have fluxes of 0.5 to 3 phot/cm^2/s
      - *Extinction correction* gives 1.5 to 12 phot/cm^2/s
  - Best match might be for LV4 (161-324)
    - from [[id:4F6EA6F7-1F1D-4EF6-BEAC-13D83C905301][NUV observations of LV4]] in [[file:~/Work/Bowshocks/Jorge/bowshock-shape/new-HST-shapes/new-hst-shapes.org][new-hst-shapes.org]] we find a radius of 0.02 arcsec or 8.6 AU, based on the FOC F235M observations in Bally:1998a Fig 8 (mislabeled as 161-322)
    - This is exceedingly small - in Henney:1998b we gave 3.5e14 cm = 23 au as the size
    - projected separation of LV 4 is 6 arcsec, so F is down by a factor of 4 compared with IRS1B, *but* ionizing flux is larger
+ Radio observations Drake:1990a
  + At the time, they thought it was from the star and was non-thermal
  + But part or all might be thermal
  + about 1 to 2 mJy at both 2 and 6 cm, falling to about 1 mJy at 20 cm
  + They also find 3 additional 6 cm sources, with fluxes of 3 to 9 mJy
  + Equivalent values for some Orion proplyds (Henney:2001b):
    - 161-324: 5 mJy and F(Ha) = 3 (Bob says 1.1)
    - 167-317: 30 mJy, but this has F(Ha) = 13 phot/cm^2/s apparently, even though Bob says only 3 - strange, but maybe Bob's values are not extinction corrected 
+ Theoretical scalings of flux, brightness, mass loss rate as functions of ionizing flux F and ionization front size r
  + For recombination dominated flow: S(Ha) \propto F \propto n^2 r
  + Ha flux has additional scaling with area: F(Ha) \propto r^2 F \propto n^2 r^3 
  + Mass loss rate Mdot \propto n r^2 \propto sqrt(F(Ha) r)
  + If r is fixed, then Mdot \propto n \propto sqrt(F) \propto 1/D where D is separation
    + But that only applies if EUV-controlled
    + If FUV controlled, then r n(PDR) = constant and Mdot \propto sqrt(T(PDR))
+ Deduced Mdot for IRS1B
  + Highest values for proplyds is 1e-6 Msun/yr with scaling as sqrt(FHa r)
  + Or theoretical scaling as (n r^2)
    + 161-324 has r15^2 n6 = 0.54
    + 167-317 has r15^2 n6 = 2.56
    + 177-341 has r15^2 n6 = 2.48
    + 182-413 has r15^2 n6 = 2.08
  + So 161-324 is 4 to 5 times smaller Mdot probably
  + Extra sqrt(2) for smaller flux means that IRS1B should be 5.65 times smaller
    + => about 2e-7 Msun/year
  + Alternatively, use the density of 8.2e6 derived above
    + Use 2 pi instead of 4 pi to account for anisotropy
    + Mdot = 2 pi m n r^2 c = 1.17e-7 Msun/yr
    + So that is only half as big
+ Isotropy of flow
  + Henney:1999a find roughly equal mass loss contributions from head and tail for 177-341
  + Also expected on theoretical grounds if neutral wind from disk is relatively insensitive to FUV flux
  + [ ] Need to work out how the anisotropy gets smoothed out with radius
+ Terminal velocity
  + For a strictly isothermal flow, the asymptotic behavior is v \propto sqrt(ln r)
  + I-front radius 2.45e14 cm expands out to bow radius of 0.1 pc = 3.085677582e17, which is factor of 1000!
    + More exactly, from Dyson:1968a we have
      r / r0 = M^-1/2 exp[ 1/4 (M^2 - 1)]
      |     M |   r/r0 | t_h/t_d |    |
      |-------+--------+---------+----|
      |     1 |    1.0 |     1.0 |    |
      |     2 |    1.5 |     6.0 |    |
      |     3 |    4.3 |    38.7 |    |
      |  3.46 |    8.4 |   100.6 |    |
      |     4 |   21.3 |   340.8 |    |
      |   4.3 |   38.2 |   706.3 | ** |
      |   4.5 |   58.0 |  1174.5 |    |
      |  4.75 |  100.6 |  2269.8 |    |
      |     5 |  180.4 |  4510.0 |    |
      |   5.5 |  639.1 | 19332.8 |    |
      | 5.666 | 1000.9 | 32132.4 | ** |
      |     6 | 2576.3 | 92746.8 |    |
      #+TBLFM: $2=exp(0.25 ($1**2 - 1)) / sqrt($1);f1::$3=$1**2 $2 ;f1
    + In other words, we can get up to M = 5.7, or v = 65 km/s if c = 11.5 km/s
  + However, more likely we reach a terminal velocity when expansion cooling starts to compete with photoionization heating
    + Photoionization heating per unit volume G = \Gamma n^2
    + Heating coefficient \Gamma \approx 2e-24 erg cm^3 / s
    + Expansion cooling term is \nabla\cdot[v (E + p)]
      + where E = \rho e + 0.5 \rho v^2 and where \rho e = p / (\gamma - 1)
      + so p + \rho e = (\gamma/\gamma-1) p = (5/2) p = (5/2) \rho c^2
      + hence [v (E + p)] = 0.5 \rho v (v^2 + 5 c^2)
    + Frank:1992a writes the expansion cooling term as
      * W = (p u / \rho^2) d\rho/dr = u c^2 d ln \rho / d r
      * This is clearly energy loss per unit mass
      * \rho = \rho_0 (r/r0)^-2 if constant velocity
        + => d\rho/dr = -2 \rho / r
        + => d ln \rho / d r = -2 / r
      * W = - 2 u c^2 / r
      * Timescale is c^2 / |W| = 0.5 r/u
    + Heating per unit mass = G/\rho
      + Heating timescale is \rho c^2 / G
      + t = m c^2 / \Gamma n \propto u r^2
    + So dynamic timescale increases linearly with radius (or slightly sub-linear since v increases), but heating timescale increases quadratically (or slightly faster) with radius
      + Ratio heating/dynamic \propto u^2 r
      + Added as column to table above
    + Values at ionization front 
      + assume n \approx 8.10^6, r = 2.45e14
      + t(heat) = 0.005 years
      + t(dynam) = 3.52 years
      + Ratio is 704
      + Implies that terminal velocity is Mach number of about 4.3, reached at about r = 40 r_0
+ Putting it all together
  + Assume Mdot = 2e-7 and V = 4.3 11.5 = 50 km/s
  + Assume L_4 = 6
  + Then \eta = 0.008 => this is about half the required value, so not good but not terrible (still 40 times higher than for star!)
+ And there is another proplyd!
  + SO587 Rigliaco:2009a
  + This is also inside the arc, but it is 160 arcsec W of Aa/Ab/B
  + Mdot only 1e-9 Msun/yr so probably not a contender

****** The Ha images
+ There are Ha, r, and i images
  + All the pointings are very similar
  + Each has 4 fields as compressed images in fits file
  + Number 4 is the one that shows the bow shock
+ They do not have useful WCS headers, but I have saved approximate values in [[file:data/Sigma-Ori/ING/4734/align-647195-ext4.wcs]]

#+BEGIN_SRC python :results output verbatim
  from astropy.io import fits

  hdulist = fits.open("data/Sigma-Ori/ING/4734/int20081118_00647195.fits.fz")

  hdulist.info()
#+END_SRC

#+RESULTS:
: Filename: data/Sigma-Ori/ING/4734/int20081118_00647195.fits.fz
: No.    Name      Ver    Type      Cards   Dimensions   Format
:   0  PRIMARY       1 PrimaryHDU     103   ()      
:   1  COMPRESSED_IMAGE    1 CompImageHDU     44   (2154, 4200)   int16   
:   2  COMPRESSED_IMAGE    2 CompImageHDU     44   (2154, 4200)   int16   
:   3  COMPRESSED_IMAGE    3 CompImageHDU     44   (2154, 4200)   int16   
:   4  COMPRESSED_IMAGE    4 CompImageHDU     44   (2154, 4200)   int16   


+ Add WCS info and split out the individual fields
#+BEGIN_SRC python :results output verbatim
  import glob
  from astropy.io import fits

  BIAS = 2210.5 
  filenames = glob.glob("data/Sigma-Ori/ING/4734/int20081118_*.fits.fz")

  for fn in filenames:
      hdulist = fits.open(fn)
      for ext, hdu in enumerate(hdulist):
          if 'IMAGE' in hdu.name:
              ohdu = fits.PrimaryHDU(header=hdulist[0].header,
                                     data=hdulist[ext].data - BIAS)
              ohdu.writeto(fn.replace(".fits.fz", f"-{ext}."fits"), overwrite=True)



#+END_SRC

#+RESULTS:



+ Try and take ratio of Ha to R, which should be more or less proportional to EW
  + Also need to remove bias, which can get from strips - first and last 50 pixels in X
  + Exposure times: 300s for Ha, 90s for r and i

#+BEGIN_SRC python :results output verbatim
  from astropy.io import fits

  # [Ha, R] image IDs
  pairs = [[176, 177],
           [180, 183],
           [185, 186],
           [188, 190],
           [192, 193],
           [195, 196],
           [198, 199],
           [201, 202],
           [204, 205],
           [207, 208],
           [210, 211],
  ]

  prefix = "data/Sigma-Ori/ING/4734/int20081118_00647"
  for id_ha, id_r in pairs:
      fn_ha = f"{prefix}{id_ha}-4.fits"
      fn_r = f"{prefix}{id_r}-4.fits"
      hdu_ha, = fits.open(fn_ha)
      hdu_r, = fits.open(fn_r)
      hdu_ha.data /= hdu_r.data
      hdu_ha.writeto(fn_ha.replace(".fits", "-ratio.fits"))
    

#+END_SRC

#+RESULTS:




***** 2MASS Near infrared
#+BEGIN_SRC python :results output
  from astropy.io import fits

  hdulist = fits.open("data/Carina/2MASS/2MASXJ10435514-5933326.fits")

  hdulist.info()
#+END_SRC

#+RESULTS:
: Filename: data/Carina/2MASS/2MASXJ10435514-5933326.fits
: No.    Name      Ver    Type      Cards   Dimensions   Format
:   0  PRIMARY       1 PrimaryHDU      51   (301, 301, 6)   float32   

***** Apex sub-mm
#+BEGIN_SRC python :results output
  from astropy.io import fits

  hdulist = fits.open("data/Carina/Apex/APEXBOL.2011-06-30T20:26:32.000.fits")

  hdulist.info()
#+END_SRC

#+RESULTS:
: Filename: data/Carina/Apex/APEXBOL.2011-06-30T20:26:32.000.fits
: No.    Name      Ver    Type      Cards   Dimensions   Format
:   0  PRIMARY       1 PrimaryHDU      39   ()      
:   1  SCAN-MBFITS    1 BinTableHDU    127   1R x 1C   [17A]   
:   2  FEBEPAR-MBFITS    1 BinTableHDU    121   1R x 23C   [1J, 1J, 1PJ(39), 1PJ(39), 1PJ(39), 39D, 39D, J, 39A, 39E, 39E, 39E, 39E, 39E, 39E, 39E, 1E, 1E, 39E, 39E, 39E, 1E, 1E]   
:   3  DATAPAR-MBFITS    1 BinTableHDU     86   16967R x 28C   [D, D, D, J, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D]   
:   4  ARRAYDATA-MBFITS    1 BinTableHDU     59   16967R x 2C   [D, 39E]   
:   5  MONITOR-MBFITS    1 BinTableHDU     30   163439R x 4C   [D, 30A, 1PD(28), 1PA(60)]   




*** Cross checking the fluxes of the EROs
+ The fluxes given in Sexton:2015a paper are much larger than in Kobulnicky:2017a
+ I want to find out which is right, using the IRAC4 8 micron image
  + Units are MJy/sr = 2.35043863818e-5 Jy/arcsec^2
  + IRAC pixels are 0.6 arcsec => 8.46e-6 Jy/pixel
  + MIPS pixels are 2.45 arcsec
+ Worked example: ERO 21 IRAC4
  + 10h 44m 05.00s -59d 33m 40.0s Equ J2000
  + Peak intensity: 1800
  + BG intensity: 250
  + Pixel Widths: 11 x 25
  + Total flux: 8.46e-6 11 25 (1800 - 250) = 3.61 Jy
+ Measure some more
  | Source | Band       |    \micro{}m |  Peak | BG             |    Bunit | Size  | Sunit | Flux                 | BG in MJy/sr    |
  |--------+------------+-------+-------+----------------+----------+-------+-------+----------------------+-----------------|
  |        | IRAC 2     | 4.493 |     7 | 5 +/- 1.5      |  2.35e-5 | 7*21  |   0.6 | 0.0025 +/- 0.0019    | 5. +/- 2.       |
  |        | IRAC 3     | 5.731 |    30 | 17 +/- 4       |  2.35e-5 | 7*21  |   0.6 | 0.0162 +/- 0.0050    | 17. +/- 4.      |
  |        | IRAC 3     | 5.731 |    27 | 17 +/- 4       |  2.35e-5 | 5*24  |     1 | 0.0282 +/- 0.0113    | 17. +/- 4.      |
  | ERO 5  | IRAC 4     | 7.872 |   170 | 65 +/- 5       |  2.35e-5 | 7*21  |   0.6 | 0.1306 +/- 0.0062    | 65. +/- 5.      |
  |        | IRAC 4     | 7.872 |   147 | 65 +/- 5       |  2.35e-5 | 5*24  |     1 | 0.2312 +/- 0.0141    | 65. +/- 5.      |
  |        | WISE 3     |    12 |  5600 | 2200 +/- 200   |  2.35e-5 | 5*24  |     1 | 9.5880 +/- 0.5640    | 2200. +/- 200.  |
  |        | WISE 4     |    22 |  1100 | 600  +/- 100   |  2.35e-5 | 5*24  |     1 | 1.4100 +/- 0.2820    | 600. +/- 100.   |
  |        | MIPS 1     | 23.68 |  1145 | 400 +/- 100    |  2.35e-5 | 5*24  |     1 | 2.1009 +/- 0.2820    | 400. +/- 100.   |
  |        | PACS 70    |    70 | 0.475 | 0.45 +/- 0.02  | 1/3.2**2 | 5*24  |     1 | 0.2930 +/- 0.2344    | 1870. +/- 83.   |
  |        | PACS 150   |   150 |  0.42 | 0.42 +/- 0.02  | 1/3.2**2 | 5*24  |     1 | 0.0000 +/- 0.2344    | 1745. +/- 83.   |
  |--------+------------+-------+-------+----------------+----------+-------+-------+----------------------+-----------------|
  |        | IRAC 2     | 4.493 |    83 | 10 +/- 6       |  2.35e-5 | 11*25 |   0.6 | 0.1698 +/- 0.0140    | 10. +/- 6.      |
  |        | IRAC 3     | 5.731 |   720 | 55 +/- 5       |  2.35e-5 | 11*25 |   0.6 | 1.5471 +/- 0.0116    | 55. +/- 5.      |
  | ERO 21 | IRAC 4     | 7.872 |  1950 | 250 +/- 50     |  2.35e-5 | 11*25 |   0.6 | 3.9551 +/- 0.1163    | 250. +/- 50.    |
  |        | PACS 70    |    70 |   6.0 | 1.5 +/- 0.5    | 1/3.2**2 | 5*6   |   3.2 | 135.0000 +/- 15.0000 | 6233. +/- 2078. |
  |        | PACS 160   |   160 |   2.5 | 1.0 +/- 0.2    | 1/3.2**2 | 5*6   |   3.2 | 45.0000 +/- 6.0000   | 4156. +/- 831.  |
  |--------+------------+-------+-------+----------------+----------+-------+-------+----------------------+-----------------|
  |        | IRAC 4     | 7.872 |    47 | 40 +/- 4       |  2.35e-5 | 12*40 |     1 | 0.0790 +/- 0.0451    | 40. +/- 4.      |
  |        | WISE 3     |    12 |  1830 | 1100 +/- 100   |  2.35e-5 | 20*40 |     1 | 13.7240 +/- 1.8800   | 1100. +/- 100.  |
  |        | WISE 4     |    22 |   430 | 280 +/- 30     |  2.35e-5 | 20*40 |     1 | 2.8200 +/- 0.5640    | 280. +/- 30.    |
  | ERO 36 | MIPS 1     | 23.68 |   427 | 120 +/- 20     |  2.35e-5 | 12*40 |     1 | 3.4630 +/- 0.2256    | 120. +/- 20.    |
  |        | PACS 70    |    70 |  0.32 | 0.24 +/- 0.01  | 1/3.2**2 | 20*40 |     1 | 6.2500 +/- 0.7813    | 997. +/- 42.    |
  |        | PACS 160   |   160 | 0.265 | 0.23  +/- 0.01 | 1/3.2**2 | 20*40 |     1 | 2.7344 +/- 0.7813    | 956. +/- 42.    |
  |--------+------------+-------+-------+----------------+----------+-------+-------+----------------------+-----------------|
  | ERO 37 | PACS B     |    70 |       |                |          |       |       | 0                    | 0e0             |
  |        | WISE 4     |    22 |       |                |          |       |       | 0                    | 0e0             |
  |        | Akari L15  |    15 |       |                |          |       |       | 0                    | 0e0             |
  |--------+------------+-------+-------+----------------+----------+-------+-------+----------------------+-----------------|
  | ERO 29 | PACS B     |    70 |       |                |          |       |       | 0                    | 0e0             |
  |        |            |       |       |                |          |       |       | 0                    | 0e0             |
  |--------+------------+-------+-------+----------------+----------+-------+-------+----------------------+-----------------|
  | ERO 16 | Akari L24  |       |       |                |          |       |       | 0                    | 0e0             |
  |        | Akari L18W |       |       |                |          |       |       | 0                    | 0e0             |
  |        | Akari L15  |       |       |                |          |       |       | 0                    | 0e0             |
  #+TBLFM: $9=$6 ($4 - $5) $7 $8**2 ; f4::$10=$5 $6 / 2.35e-5 ; f0
  + ~Bunit~ is brightness unit Jy/arcsec^2
    + 2.3504e-5 for MJy/sr
  + ~Punit~ is size unit in arcsec
  + Note that the second lot of IRAC fluxes are smoothed to the MIPS resolution and using a slightly bigger aperture
  + Herschel PACS images are in Jy/pixel
    + Pixel is 3.2 arcsec
+ ERO 29 strangeness
  + Listed as very small in Sexton:2015a: size 16.6, offset 5.2 arcsec
  + But is actually large: offset 100 arcsec!
+ ERO 16 show up clearly in Akari
  + It is seen in all 3 MIR bands, but strongest in L24
  + I measure R0 = 20 arcsec, R90 = 45 arcsec
  + Sexton:2015a had it being circular and 7.4 arcsec
  + There are several observations of similar field, for instance
    + file:data/Carina/Akari/MIR/AKARI_IRC_6171001_001_201503/
    + file:data/Carina/Akari/MIR/AKARI_IRC_6171002_001_201503/
    + Data are in the ~stacked_IM~ directory
    + Note that I had to correct the WCS to align the 3 bands with each other and with the catalog position of ERO 16
      + Need to apply files such as [[file:data/Carina/Akari/MIR/AKARI_IRC_6171002_001_201503/6171002_001_L15_long.wcs][6171002_001_L15_long.wcs]]
+ What about WISE?
  + Pixel size 1.375 arcsec
  + ~BUNIT~ says that intensity is in ~DN~, which isn't helpful
  + We could calibrate IRAC 4 against MIPS 1 with ERO 36
+ We also have Akari - but very low resolution
  + FIR is only useful for ERO 29, but MIR is much better (although spotty coverage)
    + See ERO 16 discussion above
  + FIR Bands:
    + N60 :: 65 micron
    + Wide S :: 90 micron
    + Wide L :: 140 micron
    + N160 :: 160 micron
  + MIR bands
    + 15, 18, 24 micron
+ Possible new bow shock
  + WERO 40
  + 10:47:11.68 -60:20:48.73
  + Detected in Akari, but there is only L15 observations of the field
    + Example: [[file:data/Carina/Akari/MIR/AKARI_IRC_6170001_001_201503/stacked_IM/6170001_001_L15_long.fits]]
    + Also 6170005, and 6170006
+ ERO 37 also show up in Akari L15
  + 1650296_001
*** Densities and column densities
+ Kobulnicky:2018a find the stream density by
  1. Converting the 70 micron emission to column density, using Draine:2007a
  2. Using measured chord length to convert this into shell density
  3. Assume density jump of 4 across the shock to find the pre-shock density
+ Step 3 is the most problematic, since this only applies if the shock is non-radiative
  + For O9 and above, shock is strongly radiative above n = 1 for V = 30 km/s
  + So compression should be M^2 = 9, which is twice as high
+ Conclusion: stream densities should be 2 times lower, which implies /two times lower mass loss rates/
  + But we eliminate dependence on the stream velocity, since shell density is proportional to V^2, exactly the same as external ram pressure
+ We could also do an alternative method based on the column density
  + This requires knowing the shell thickness ratio, H/R, so we can estimate the limb brightening
  + Observed column from 70 micron surface brightness is n_1 L, where L is the chord length
  + Then use n_1 H = 3/4 n_0 R
+ Relating 70 micron emission to column density
  + Quantity j_\nu gives conversion: S_70 = j_\nu N_H
  + S_70 = 8e8 Jy/sr for brightest
  + j_\nu = about 1e-11, depending on radiation field at shell
  + => N_H = 1e20 H cm^-2
    + => \tau = 0.13
  + But this is across the chord length - the thickness will be less by a factor of 5-10, so \tau < 0.026
  + We can actually work it all out from the real data
    + Compare \tau and \eta as calculated from Kobulnicky:2018a data
    + The "radius" R and thickness H is given in the previous paper Kobulnicky:2017a
      + But note that R is not R0, but more like R90 (although as far as I can see, it is not measured from the star)
    + They also have a table with the R0 values (Kobulnicky:2017a Table 5) for just the sub-sample of known distance
      + But there are some inconsistencies:
        + Source 13 (zeta Oph): 29 (K17) versus 299 (K18) arcsec.  Clearly the second is correct
        + Source 331: 25 vs 42
        + Source 381: 71 vs 220
        + I will take the second one (K18) in all cases
    + Better idea - work out the optical depth from \tau = 2 L_{IR} / L_{*}

#+name: kob18
|  ID |    L4 |   V3 |    R0 |    S7 | R0_as |  l_as | l/R0 | j_-12 | D_kpc | FIR_-9 |  L*/LIR | Md_-8 |
|-----+-------+------+-------+-------+-------+-------+------+-------+-------+--------+---------+-------|
|  13 |   8.1 |  1.3 | 0.175 |  12.3 |   299 |   277 | 0.93 |   8.7 |  0.11 |   64.0 | 3339.43 |   5.4 |
|  67 |   5.1 |  1.3 | 0.080 |  64.0 |   7.5 |    15 | 2.00 |  11.0 |  1.99 |   58.0 |    7.09 |   6.2 |
| 329 |   7.9 |  2.0 | 0.219 |  15.4 |    10 |    27 | 2.70 |   8.4 |   4.1 |   0.51 |  294.20 |   2.5 |
| 331 |  12.0 |  2.5 | 0.296 |  12.0 |    42 |    55 | 1.31 |   8.3 |  1.32 |    5.3 |  414.87 |   4.5 |
| 338 |   7.9 |  1.2 | 0.162 |  79.8 |    23 |    29 | 1.26 |   8.9 |  1.32 |    6.9 |  209.79 |    33 |
| 339 |  32.0 |  2.9 | 0.493 |  29.9 |    70 |    47 | 0.67 |   8.3 |  1.32 |    6.0 |  977.24 |    31 |
| 341 |   5.1 |  1.3 | 0.141 |   5.0 |    20 |    31 | 1.55 |   8.7 |  1.32 |    1.9 |  491.84 |   1.4 |
| 342 |   1.4 |  0.8 | 0.070 |  57.8 |    10 |    14 | 1.40 |   8.9 |  1.32 |   0.60 |  427.54 |    14 |
| 344 |  87.0 |  3.0 | 1.359 |  58.6 |   193 |   170 | 0.88 |   8.0 |  1.32 |   50.0 |  318.83 |   130 |
| 368 |   4.1 |  1.2 | 0.146 |  24.9 |    14 |    22 | 1.57 |   8.5 |  1.95 |   0.14 | 2458.89 |   7.7 |
| 369 |   9.7 |  2.5 | 0.759 |   7.9 |    73 |    39 | 0.53 |   7.8 |  1.95 |    1.4 |  581.74 |    19 |
| 380 |   2.6 |  1.2 | 0.021 |  35.7 |    15 |    49 | 3.27 |  30.0 |  0.26 |    3.3 | 3721.05 |  0.22 |
| 381 |  12.0 |  2.5 | 0.739 |   4.6 |   220 |   200 | 0.91 |   7.9 |  0.63 |    4.4 | 2193.81 |   6.4 |
| 382 |  12.0 |  1.2 | 0.506 |  11.2 |   101 |    70 | 0.69 |   8.0 |  0.94 |    3.2 | 1354.96 |    29 |
| 406 |   8.2 |  1.3 | 0.201 |  29.1 |    16 |    26 | 1.63 |   8.5 |  2.35 |    1.9 |  249.50 |    11 |
| 407 |  14.0 |  1.3 | 0.098 |  58.2 |   7.8 |    25 | 3.21 |  13.0 |  2.35 |    6.3 |  128.47 |   3.5 |
| 409 |   7.4 |  1.2 | 0.093 |  20.8 |   7.4 |    17 | 2.30 |  11.0 |  2.35 |   0.76 |  562.90 |   2.2 |
| 410 |   4.1 |  1.2 | 0.046 |  91.4 |   3.7 |    14 | 3.78 |  15.0 |  2.35 |    1.1 |  215.48 |   2.1 |
| 411 |   4.1 |  1.2 | 0.052 |  41.5 |   4.2 |    16 | 3.81 |  13.0 |  2.35 |   0.40 |  592.57 |   1.2 |
| 413 |   5.1 |  1.3 | 0.188 |  15.4 |    15 |    24 | 1.60 |   8.3 |  2.35 |    1.0 |  294.84 |   5.7 |
|-----+-------+------+-------+-------+-------+-------+------+-------+-------+--------+---------+-------|
|     | 12.49 | 1.62 |  0.29 | 33.78 | 57.58 | 58.35 | 1.80 | 10.51 |  1.70 |  10.86 |  941.75 | 15.80 |
|     | 18.70 | 0.67 |  0.33 | 26.12 | 83.72 | 71.69 | 1.04 |  5.02 |  0.91 |  20.27 | 1099.22 | 28.77 |
#+TBLFM: $8=$-1/$-2;f2::$12=1e4 $2 $Lsun / (4 $pi ($-2 1000 $pc)**2 1e-9 $-1) ; f2::@22$2..@22$13=vmean(@I..@II);f2::@23$2..@23$13=vsdev(@I..@II);f2

#+BEGIN_SRC python :var TAB=kob18 :colnames no :return tab
  from astropy.table import Table
  tab = Table(rows=TAB[1:-2], names=TAB[0])
  tab.write('kob18.fits', overwrite=True)
#+END_SRC

#+RESULTS:
#+begin_example
ID  L4   V3   R0   S7  R0_as l_as l/R0 j_-12 D_kpc FIR_-9  L*/LIR Md_-8
--- ---- --- ----- ---- ----- ---- ---- ----- ----- ------ ------- -----
 13  8.1 1.3 0.175 12.3 299.0  277 0.93   8.7  0.11   64.0 3339.43   5.4
 67  5.1 1.3  0.08 64.0   7.5   15  2.0  11.0  1.99   58.0    7.09   6.2
329  7.9 2.0 0.219 15.4  10.0   27  2.7   8.4   4.1   0.51   294.2   2.5
331 12.0 2.5 0.296 12.0  42.0   55 1.31   8.3  1.32    5.3  414.87   4.5
338  7.9 1.2 0.162 79.8  23.0   29 1.26   8.9  1.32    6.9  209.79  33.0
339 32.0 2.9 0.493 29.9  70.0   47 0.67   8.3  1.32    6.0  977.24  31.0
341  5.1 1.3 0.141  5.0  20.0   31 1.55   8.7  1.32    1.9  491.84   1.4
342  1.4 0.8  0.07 57.8  10.0   14  1.4   8.9  1.32    0.6  427.54  14.0
344 87.0 3.0 1.359 58.6 193.0  170 0.88   8.0  1.32   50.0  318.83 130.0
368  4.1 1.2 0.146 24.9  14.0   22 1.57   8.5  1.95   0.14 2458.89   7.7
369  9.7 2.5 0.759  7.9  73.0   39 0.53   7.8  1.95    1.4  581.74  19.0
380  2.6 1.2 0.021 35.7  15.0   49 3.27  30.0  0.26    3.3 3721.05  0.22
381 12.0 2.5 0.739  4.6 220.0  200 0.91   7.9  0.63    4.4 2193.81   6.4
382 12.0 1.2 0.506 11.2 101.0   70 0.69   8.0  0.94    3.2 1354.96  29.0
406  8.2 1.3 0.201 29.1  16.0   26 1.63   8.5  2.35    1.9   249.5  11.0
407 14.0 1.3 0.098 58.2   7.8   25 3.21  13.0  2.35    6.3  128.47   3.5
409  7.4 1.2 0.093 20.8   7.4   17  2.3  11.0  2.35   0.76   562.9   2.2
410  4.1 1.2 0.046 91.4   3.7   14 3.78  15.0  2.35    1.1  215.48   2.1
411  4.1 1.2 0.052 41.5   4.2   16 3.81  13.0  2.35    0.4  592.57   1.2
413  5.1 1.3 0.188 15.4  15.0   24  1.6   8.3  2.35    1.0  294.84   5.7
#+end_example


+ Flux conversions:
  + 1 Jy = 1e-23 erg/s/cm^2/Hz
  + So we can find the total flux in erg/s/cm^2 by summing the
    spectral fluxes in Jy times bandwidths \Delta\nu in each band
    |          |  \micro{}m |   \Delta\nu Hz |
    |----------+-----+---------|
    | IRAC     |   8 | 1.45e13 |
    | MIPS     |  24 |  4.6e12 |
    | MIPS     |  70 |  1.2e12 |
    | MIPS     | 160 |  5.5e11 |
    | Herschel |  70 | 6.48e11 |
    | Herschel | 160 | 3.54e11 |
  + So, estimate for total flux in units of 1e-10 erg/cm^2/s
    + 1.45 S_8 + 0.46 S_24 + 0.0648 S_70 + 0.0354 S_160
  + But that leaves gaps in between the bands, so best to use the difference between bands as the \delta\nu:
    | \lambda, \micro{}m |  \nu, Hz |     \delta\nu | \langle \delta\nu \rangle |
    |-------+--------+--------+--------|
    |     5 | 6.0e13 | 2.3e13 | #ERROR |
    |     8 | 3.7e13 | 2.5e13 | 2.4e13 |
    |    24 | 1.2e13 | 7.7e12 | 1.6e13 |
    |    70 | 4.3e12 | 2.4e12 | 5.1e12 |
    |   160 | 1.9e12 | 1.6e12 |   2e12 |
    |  1000 | 3.0e11 |        |        |
    #+TBLFM: $2=$c / $1 $micron ;s2::$3=$-1 - @+1$-1::$4=(@-1$3 + $3)/2;s2
  + The third column is the forward difference, while fourth column is the centered difference, which should be better
  + So this would give a better total flux of
    + 2.4 S_8 + 1.6 S_24 + 0.51 S_70
    + Note that we are only using 3 bands
    + /Old version/:
      + 2.3 S_5 + 2.5 S_8 + 0.77 S_24 + 0.24 S_70 + 0.16 S_160
  + E.g., source 13 (subbing S_12 for S_8):
    + (2.3 8 + 2.5 51.32 + 0.77 343 + 0.24 246 + 0.16 62)
    + (18.4 + 128.3 + 264.11 + 59.04 + 9.92) = 479.77e-10 = 5e-8 as in Table!
  + And source 67
    + (2.3 0 + 2.5 0.31 + 0.77 27.66 + 0.24 4.4 + 0.16 5.4)
    + (0 + 0.775 + 21.2982 + 1.056 + 0.864) = 23.99e-10 = 2.4e-9
    + This is less than 5% of the 6e-8 in table! That seemed to be based on a very high-T fit, which cannot be right.
  + So, in both cases, over 90% of total IR flux comes from 8, 24, 70 micron bands
  + In K17 they give peak S(70) in Jy/arcmin^2, whereas in K18 it is in Jy/sr
    + Conversion factor is (180 60 / pi)**2 = 1.18e7
  + SEDs: Draine:2007a uses ratios based on \nu F_\nu, so factors that multiply F_\nu for each band are (normalized to 70 micron)
    |     \lambda | \langle\nu F_\nu\rangle/F_\nu |
    |-------+-------------|
    | 4.493 |       15.58 |
    | 5.731 |       12.21 |
    | 7.872 |        8.89 |
    |    24 |        2.92 |
    |    70 |           1 |
    |   160 |        0.44 |
    #+TBLFM: $2=70/$1;f2
*** Compare momentum efficiency with optical depth for bow shell
+ This is done in the notebook
  + [[file:Kobulnicky-samples.ipynb]]
+ Figure is written to
  + [[file:K18-eta-tau.pdf]]
+ \tau is calculated as 2 L_IR / L_*
+ \eta is calculated as P_shell / P_rad
  + Note that this is really \Xi^-1 for the shell
  + If we assume v = 30 km/s, like K18, then the ambient density is (30/11)**2 = 7.4 times lower, so that \Xi = 1000 outside shell is lowered to \Xi = 135 inside shell, so \eta = 7.4e-3
  + We have one source that is clearly in the dust-wave candidate region
    + Source 380 - HD 53367 - Herbig Be star
  + And several other sources that are marginal
    + 13 - \zeta Ophiuchus - O9.2 IV
    + 368 - KM Cassiopeia - O9.5V
    + 339 - CPR2002A37 - O5V((f)) - /probably not since \Xi_\dag = 3000 for O star/
    + 409 - HD93027 - O9.5IV
+ How does \eta relate to observed properties?
  1. Shell surface density \Sigma = \tau/\kappa
  2. Shell pressure P_{shell} = \rho a^2 = \Sigma a^2 / H = \tau a^2 / \kappa H
  3. Assume H = 0.25 R_0
  4. So \eta_{shall} = P_{shell} / P_{rad} = \Xi^{-1} = \tau a^{2} 4\pi R^{2} c / \kappa H L_{*}
  5. In fiducial terms: \eta_{shell} = 245 \tau R_{pc} T_{4} / \kappa_{600} h_{1/4} L_{4}
     - From the pairplot figure, there *is* a linear relation between R and L, which is approximately R_{pc} = 0.02 L_{4}, which implies \eta_{shell} = 5 \tau T_{4} / \kappa_{600} h_{1/4}
+ [ ] But why is there a linear relation between \eta_{shell} and \tau if the shells are not radiation-supported?
  - To make it so that the lower envelope coincided with \eta = \tau, then the \eta's would need to be brought down by a factor of 1.5
  - This could be by either
    1. Increasing \kappa - currently we have 600 cm^2/g = 1.3e-21 cm^2/H
       - In principal this will be higher for diffuse cloud dust than for dense cloud dust - see Bertoldi:1996a
       - We need to work out whether we mean absorption or extinction or radpress version of opacity
         + actually *absorption*, so hard to make it larger than 600 
       - Also, whether it is more important the FUV or the EUV
       - *But* the \eta = \tau line should be the radpress \tau, which is higher by a factor of Q_{P}/Q_{abs} = [(1 - \omega) + (1 - g) \omega]/(1 - \omega) = 1 + (1 - g)\omega/(1 - \omega) = 1.5 if \omega = g = 0.5
    2. Reducing sound speed (currently assume 1e4 K) 
       - down to 6700 K would do it (probably too cool though)
       - Cloudy models give 1.1e4 K for 40 Msun model, but 7000 K for 10 Msun model
    3. Increasing H/R, but 0.25 is probably about right for most sources
  - There is also the slight worry that as \eta is derived, it is proportional to \tau
+ Doing the same for our other objects
  + th1D, LP Ori, \sigma Ori, AE Aur
  + th1D has L_* = 2.95e4, R = 0.003 pc, L_IR = 616.6 Lsun
    + \tau = 2 L_IR/L_* = 0.042
    + \eta = 0.010 /unless/ we reduce \kappa_{600} h_{1/4}
      + There is evidence that \kappa is actually 100
      + And h could be smaller too
      + But if we move this, why not all the others?
      + With \kappa = 100 we have \eta_sh = 0.06
    + Upper limit on th1D wind (use \kappa = 100)
      + Mdot_-7 = 2.02 \eta_w L_4 / V_3
      + \eta_w = 0.060 - 1.25 0.042 = 7.5e-3
      + L4 = 2.95
      + V_3 doesn't seem to have any direct measurements
        + B0.5V star, so should be 2500 from Vink
        + Also Krticka:2007a gives 2440
        + But 1460 according to Prinja:1990a
        + Mokiem:2007a who are cited by K18 do not have a B0.5V star
          + Closest is B0.2V (\tau Sco) which they give 2000 km/s
        + Simon-Diaz:2006a give
          + R = 5.6 +/- 0.8 R_\odot
          + M = 18 +/- 6 M_\odot
          + log g = 4.2 +/- 0.1
          + T = 32 kK
          + g = G M / R^2
          + 0.5 Vesc^2 = G M / R = g / R => Vesc = sqrt(2 g R)
          + Vesc = 1100 +/- 150
          + Vw = 2.6 Vesc = 2900 +/- 400 km/s
        + Take 2500 as compromise
      + Mdot = 0.017877 = 1.8e-9
  + LP Ori has L_* = 1600, R = 0.01 pc, L_IR = 238.9 Lsun
    + \tau = 2 L_IR/L_* = 0.30
    + \eta = 4.6 if T = 1e4 K
  + \sigma Ori has L_* = 6e4, R = 0.12 pc, L_IR = 15 Lsun
    + But actually, there are 3 stars:
      + Aa: L4 = 4.14 +/- 0.06, T = 35 kK
      + Ab: L4 = 1.86 +/- 0.03, T = 31 kK
      + B: L4 = 1.58 +/- 0.05, T = 29 kK
      + Total: 7.58 +/- 0.08
    + \tau = 2 L_IR/L_* = 3.96e-4
    + \eta_sh = 245 \tau R_{pc} T_{4} / \kappa_{600} h_{1/4} L_{4} = 1.54e-3
      + \eta_w = 1.54e-3 - 1.25 3.96e-4 = 1.045e-3
    + Finding Mdot for \sigma Ori
      + Mdot_-7 = 2.02 \eta_w L_4 / V_3
      + V_3 = 1.5
      + Mdot_-7 = 2.02 1.045e-3 7.58 / 1.5 = 0.0107 => 1.1e-9
      + Measured optical Mdot = 2e-10
+ Value of \Xi just outside shell
  + By definition \tau = 2 \rho_{0} \kappa R_{0} and \tau = \rho_{sh} \kappa H
  + => \rho_{sh} / \rho_{0} = 2 R_{0} / H
  + So H / R_{0} = 0.25 => \rho_sh = 8 \rho_0 => \Xi = 8 \eta_{sh}^{-1} or \eta_{sh} =  8 \Xi^{-1}
    |    \Xi |   \eta_{sh} |
    |------+-------|
    | 1000 | 0.008 |
    | 3000 | 0.003 |
    #+TBLFM: $2=8 / $1 ;f3
  + Although we need to also note two things:
    1. The \Xi where DW forms may be \Xi_{\ddag}, which is less than \Xi_{\dag}
    2. If we /do/ have a DW, then gas density cannot be diagnosed from \tau
+ Not sure I did the shell compression right - try again:
  - n_sh / n_0 = 3/4 R_0 / h from eq (22)
  - How is this consistent with eq (8)?
  - Answer: it isn't
    - But I think that is to be expected, since they are in different limits: bow wave versus bow shock
+ Sensitivity to parameters
  + \tau = 2 L_IR/L_\star
    + F_IR = 1e-10 F_-10 erg/s/cm^2
    + L_IR = 1.20e34 D_kpc^2 F_-10 erg/s = 3.132 F_-10 D_kpc^2 Lsun
    + \tau = 6.264e-4 F_-10 D_kpc^2 / L_4
  + and \eta =  245 \tau R_{pc} T_{4} / \kappa_{600} h_{1/4} L_{4}
    + R_pc = 0.00485 \theta_as D_kpc
    + \eta =  7.443e-4 F_-10 D_kpc^3 \theta_as T_{4} / \kappa_{600} h_{1/4} L_{4}^2
  + So calculate [a, b] = [d ln \tau / d ln X, d ln \eta / d ln X]
  + \tau : [+1, +1]
  + \theta : [0, +1]
  + F_IR : [+1, +1]
  + L_* : [-1, -2]
  + D : [+2, +3]
  + T : [0, +1]
  + \kappa : [0, -1]
  + H/R : [0, -1]
+ Error ellipse:
  | observable | dex \sigma | d\tau | d\eta |  \sigma(\tau) |  \sigma(\eta) | squared | squared |  abs |  abs |
  |------------+-------+----+----+-------+-------+---------+---------+------+------|
  | D          |  0.08 |  2 |  3 |  0.16 |  0.24 |  0.0256 |  0.0576 | 0.16 | 0.24 |
  | L_\star        |  0.18 | -1 | -2 | -0.18 | -0.36 |  0.0324 |  0.1296 | 0.18 | 0.36 |
  | F_IR       |  0.12 |  1 |  1 |  0.12 |  0.12 |  0.0144 |  0.0144 | 0.12 | 0.12 |
  | \theta          |  0.11 |  0 |  1 |    0. |  0.11 |      0. |  0.0121 |   0. | 0.11 |
  |------------+-------+----+----+-------+-------+---------+---------+------+------|
  |            |       |    |    |     0 |     0 |    0.27 |    0.46 | 0.46 | 0.83 |
  #+TBLFM: $5=$2 $3::$6=$2 $4::$7=$-2**2::$8=$-2**2::$9=abs($-4)::$10=abs($-4)::@6$7..@6$8=sqrt(vsum(@I..@II));f2::@6$9..@6$10=vsum(@I..@II);f2
  + So, ellipse should be in box 0.25x0.39 and should have major axis at (0.41, 0.62)
+ Do the same but along \eta\tau and \eta/\tau axes
  | observable | dex \sigma | d\tau | d\eta | \sigma(\eta \tau) | \sigma(\eta/\tau) | squared | squared |  abs |  abs |
  |------------+-------+----+----+--------+--------+---------+---------+------+------|
  | D          |  0.08 |  2 |  3 |    0.4 |   0.08 |    0.16 |  6.4e-3 |  0.4 | 0.08 |
  | L_\star        |  0.18 | -1 | -2 |  -0.54 |  -0.18 |  0.2916 |  0.0324 | 0.54 | 0.18 |
  | F_IR       |  0.12 |  1 |  1 |   0.24 |     0. |  0.0576 |      0. | 0.24 |   0. |
  | \theta          |  0.11 |  0 |  1 |   0.11 |   0.11 |  0.0121 |  0.0121 | 0.11 | 0.11 |
  |------------+-------+----+----+--------+--------+---------+---------+------+------|
  |            |       |    |    |      0 |      0 |    0.72 |    0.23 | 1.29 | 0.37 |
  #+TBLFM: $5=$2 ($3 + $4)::$6=$2 ($4 - $3)::$7=$-2**2::$8=$-2**2::$9=abs($-4)::$10=abs($-4)::@6$7..@6$8=sqrt(vsum(@I..@II));f2::@6$9..@6$10=vsum(@I..@II);f2
  + This confirms that error ellipse should have axis ratio of at least 3:1
  + If we divide by sqrt(2), then we get a sigma of
    + 0.51 dex along sqrt(\eta \tau) or 0.72 dex of \eta\tau
    + 0.16 dex along sqrt(\eta/\tau) or 0.23 dex of \eta/\tau
  + Both are dominated by luminosity uncertainty

+ Conversion to mass-loss rate
  + Mdot_-7 = 2.02 \eta_w L_4 / V_3
    + \eta_w = \eta_sh - 1.25 Q \tau
    + where Q = (Q_P/Q_abs) / 1.25
  + Mdot_-7 = (2.02 L_4 / V_3) [7.443e-4 (F_-10 D_kpc^3 \theta_as T_{4} / \kappa_{600} h_{1/4} L_{4}^2) - 7.83e-4 Q F_-10 D_kpc^2 / L_4 ]
    + = 1.503e-3 (F_-10 D_kpc^2 / V_3) [(D_kpc  \theta_as T_{4} / \kappa_{600} h_{1/4} L_{4}) - 1.05 Q]
  + So, if we are in the limit \eta_w \gg 1.25 \tau, then we can find d ln Mdot / d ln X
    + F_-10 : +1
    + D_kpc : +3
    + \theta_as : +1
    + L_4 : -1
    + V_3 : -1 (this has 50% uncertainty according to K18 => 0.18 dex)
    + Assumed parameters: T_{4} / \kappa_{600} h_{1/4}
+ Do the same with K18 mass-loss method
  + They give Mdot \propto \theta D v^2 I_70 / V_3 (\ell/R) j_70
  + Where j_70 \propto sqrt(U) \propto L_4^1/2 / \theta D
  + So we finally get Mdot \propto \theta^2 D^2 v^2 I_70 / V_3 (\ell/R) L_4^1/2 j_70
    + We still left a j_70 in there to account for changes in dust abundance or size
  + Hence for d ln Mdot / d ln X we get:
    + I_70 : +1
    + D_kpc : +2
    + \theta_as : +2
    + L_4 : -0.5
    + (\ell/R) : -1 (this is an observed quantity - assign 20% uncertainty)
    + V_3 : -1 (this is assigned per object based on spectral type)
    + Assumed parameters: v^2 \delta / j_70
+ So we can do the same error ellipse MH is us, MK is K18
  |      | dex \sigma | dMH |  dMK | dH/K | \sigma(MH) | Squared | \sigma(MK) | Squared | \sigma(H/K) | Squared |
  |------+-------+-----+------+------+-------+---------+-------+---------+--------+---------|
  | D    |  0.08 |   3 |    2 |    1 |  0.24 |  0.0576 |  0.16 |  0.0256 |   0.08 |  0.0064 |
  | L_*  |  0.18 |  -1 | -0.5 | -0.5 | -0.18 |  0.0324 | -0.09 |  8.1e-3 |  -0.09 |  0.0081 |
  | F_IR |  0.12 |   1 |    0 |    1 |  0.12 |  0.0144 |    0. |      0. |   0.12 |  0.0144 |
  | I_70 |  0.12 |   0 |    1 |   -1 |    0. |      0. |  0.12 |  0.0144 |  -0.12 |  0.0144 |
  | \theta    |  0.11 |   1 |    2 |   -1 |  0.11 |  0.0121 |  0.22 |  0.0484 |  -0.11 |  0.0121 |
  | \ell/R  |  0.08 |   0 |   -1 |    1 |    0. |      0. | -0.08 |  6.4e-3 |   0.08 |  0.0064 |
  | V_3  |  0.18 |  -1 |   -1 |    0 | -0.18 |  0.0324 | -0.18 |  0.0324 |     0. |  0.0000 |
  |------+-------+-----+------+------+-------+---------+-------+---------+--------+---------|
  |      |       |     |      |    0 |     0 |    0.39 |     0 |    0.37 |      0 |    0.25 |
  #+TBLFM: $5=$3 - $4::$6=$2 $3::$7=$-1**2::$8=$2 $4::$9=$-1**2::$10=$2 $5::$11=$-1**2;f4::@9$7=sqrt(vsum(@I..@II));f2::@9$9=sqrt(vsum(@I..@II));f2::@9$11=sqrt(vsum(@I..@II));f2
  + Bottom row gives dex \sigma for:
    + Our Mdot : 0.37 dex or factor of 2.34
      + Most important D (42% of variance), then L_* and V_3 (24% each)
    + K18 Mdot : 0.35 dex or factor of 2.24
      + Most important \theta (40%) then V_3 (26%) then D (21%)
    + Mdot ratio : 0.21 dex or factor 1.62
      + Most important \theta (27%) then L_* (18%)
      + I eventually decided I shouldn't divide by sqrt(2)
+ Do the same for diagonal lines Mdot L and Mdot/L
  |      | dex \sigma | dMH | dL |     \sigma(MH L) |      Squared |   \sigma(MH / L) |      Squared |
  |------+-------+-----+----+-------------+--------------+-------------+--------------|
  | D    |  0.08 |   3 |  0 |  0.16970563 |  0.028800001 |  0.16970563 |  0.028800001 |
  | L_*  |  0.18 |  -1 |  1 |          0. |           0. | -0.25455844 |  0.064799999 |
  | F_IR |  0.12 |   1 |  0 | 0.084852814 | 7.2000000e-3 | 0.084852814 | 7.2000000e-3 |
  | I_70 |  0.12 |   0 |  0 |          0. |           0. |          0. |           0. |
  | \theta    |  0.11 |   1 |  0 | 0.077781746 | 6.0500000e-3 | 0.077781746 | 6.0500000e-3 |
  | \ell/R  |  0.08 |   0 |  0 |          0. |           0. |          0. |           0. |
  | V_3  |  0.18 |  -1 |  0 | -0.12727922 |  0.016200000 | -0.12727922 |  0.016200000 |
  |------+-------+-----+----+-------------+--------------+-------------+--------------|
  |      |       |     |    |          0. |         0.24 |          0. |         0.35 |
  #+TBLFM: $5=$2 ($3 + $4) / sqrt(2)::$6=$-1**2::$7=$2 ($3 - $4) / sqrt(2)::$8=$-1**2::@9$6=sqrt(vsum(@I..@II));f2::@9$8=sqrt(vsum(@I..@II));f2
  + That does not help at all!
  + We should really take eigenvectors of covariance matrix
***** \tau-\eta covariance
+ write \Delta_{x}\tau = A_{\tau{}i} = d ln \tau / d ln x_{i} and \Delta_{x}\eta = A_{\eta{}i}
+ covariance array C = [ [C\tau\tau, C\tau\eta], [C\eta\tau, C\eta\eta]]
| x   | dex \sigma | \Delta_{x}\tau | \Delta_{x}\eta |    C\tau\tau |    C\tau\eta |    C\eta\tau |    C\eta\eta |
|-----+-------+-----+-----+--------+--------+--------+--------|
| D   |  0.08 |   2 |   3 | 0.0256 | 0.0384 | 0.0384 | 0.0576 |
| L_{\star}  |  0.18 |  -1 |  -2 | 0.0324 | 0.0648 | 0.0648 | 0.1296 |
| F_{IR} |  0.12 |   1 |   1 | 0.0144 | 0.0144 | 0.0144 | 0.0144 |
| \theta   |  0.11 |   0 |   1 |     0. |     0. |     0. | 0.0121 |
|-----+-------+-----+-----+--------+--------+--------+--------|
|     |       |     |     | 0.0724 | 0.1176 | 0.1176 | 0.2137 |
#+TBLFM: $5=$2**2 $3 $3::$6=$2**2 $3 $4::$7=$2**2 $4 $3::$8=$2**2 $4 $4::@6$5..@6$8=vsum(@I..@II)

#+BEGIN_SRC python :results output
  import numpy as np
  cov = np.array([[0.0724, 0.1176], [0.1176, 0.2137]])
  eigvals, eigvecs = np.linalg.eigh(cov)
  for i, eigval in enumerate(eigvals):
      x, y = eigvecs[:, i]
      print(
          f'sig = {np.sqrt(eigval):.3f}'
          f' in direction [{x:.3f}, {y:.3f}]'
          f' angle = {np.rad2deg(np.arctan2(y, x)):.1f} deg'
      )
  theta = 0.5*np.arctan2(2*cov[0, 1], cov[0, 0] - cov[1, 1])
  print(f'alt angle = {np.rad2deg(theta):.1f}')
#+END_SRC

#+RESULTS:
: sig = 0.077 in direction [-0.870, 0.492] angle = 150.5 deg
: sig = 0.529 in direction [0.492, 0.870] angle = 60.5 deg
: alt angle = 60.5

+ 1 dex = 3.068 cm
+ ellipse (+/- 1 \sigma)= [3.246, 0.472] @ 60.5 deg
***** Mdot-L covariance - our method
| x   | dex \sigma | \Delta_{x}L | \Delta_{x}Md |    CLL |    CLMd |    CMdL |  CMdMd |
|-----+-------+-----+------+--------+---------+---------+--------|
| D   |  0.08 |   0 |    3 |     0. |      0. |      0. | 0.0576 |
| L_{\star}  |  0.18 |   1 |   -1 | 0.0324 | -0.0324 | -0.0324 | 0.0324 |
| F_{IR} |  0.12 |   0 |    1 |     0. |      0. |      0. | 0.0144 |
| \theta   |  0.11 |   0 |    1 |     0. |      0. |      0. | 0.0121 |
| V_3 |  0.18 |   0 |   -1 |     0. |      0. |      0. | 0.0324 |
|-----+-------+-----+------+--------+---------+---------+--------|
|     |       |     |      | 0.0324 | -0.0324 | -0.0324 | 0.1489 |
#+TBLFM: $5=$2**2 $3 $3::$6=$2**2 $3 $4::$7=$2**2 $4 $3::$8=$2**2 $4 $4::@7$5..@7$8=vsum(@I..@II)

#+BEGIN_SRC python :results output
  import numpy as np
  cov = np.array([[0.0324, -0.0324], [-0.0324, 0.1489]])
  #cov = np.array([[0.0841, 0.0], [0.0, 0.0324]])
  eigvals, eigvecs = np.linalg.eigh(cov)
  for i, eigval in enumerate(eigvals):
      x, y = eigvecs[:, i]
      print(
          f'sig = {np.sqrt(eigval):.3f}'
          f' in direction [{x:.3f}, {y:.3f}]'
          f' angle = {np.rad2deg(np.arctan2(y, x)):.1f} deg'
      )
  theta = 0.5*np.arctan2(2*cov[0, 1], cov[0, 0] - cov[1, 1])
  print(f'alt angle = {np.rad2deg(theta):.1f}')
#+END_SRC

#+RESULTS:
: sig = 0.155 in direction [-0.968, -0.251] angle = -165.5 deg
: sig = 0.397 in direction [-0.251, 0.968] angle = 104.5 deg
: alt angle = -75.5
***** Mdot-L K18 method
Take the C array from down below
#+BEGIN_SRC python :results output
  import numpy as np
  cov = np.array([[0.0324, -0.0162], [-0.0162, 0.1353]])
  #cov = np.array([[0.0841, 0.0], [0.0, 0.0324]])
  eigvals, eigvecs = np.linalg.eigh(cov)
  for i, eigval in enumerate(eigvals):
      x, y = eigvecs[:, i]
      print(
          f'sig = {np.sqrt(eigval):.3f}'
          f' in direction [{x:.3f}, {y:.3f}]'
          f' angle = {np.rad2deg(np.arctan2(y, x)):.1f} deg'
      )
  [a, b], [c, d] = cov
  theta = 0.5*np.arctan2(2*b, a - d)
  print(f'alt angle = {np.rad2deg(theta):.1f}')
  D = (a + d)**2 - 4*(a*d - b*c)
  lam1 = 0.5*((a + d) + np.sqrt(D))
  lam2 = 0.5*((a + d) - np.sqrt(D))
  print(f'alt sigs = {np.sqrt(lam1):.3f} and {np.sqrt(lam2):.3f}')
#+END_SRC

#+RESULTS:
: sig = 0.173 in direction [-0.988, -0.152] angle = -171.3 deg
: sig = 0.371 in direction [-0.152, 0.988] angle = 98.7 deg
: alt angle = -81.3
: alt sigs = 0.371 and 0.173

***** Mdot-Mdot covariance
| x   | dex \sigma | \Delta_{x}MdK | \Delta_{x}Md |    C11 |    C12 |    C21 |    C22 |
|-----+-------+-------+------+--------+--------+--------+--------|
| D   |  0.08 |     2 |    3 | 0.0256 | 0.0384 | 0.0384 | 0.0576 |
| L_{\star}  |  0.18 |  -0.5 |   -1 | 8.1e-3 | 0.0162 | 0.0162 | 0.0324 |
| F_{IR} |  0.12 |     0 |    1 |     0. |     0. |     0. | 0.0144 |
| I_{70} |  0.12 |     1 |    0 | 0.0144 |     0. |     0. |     0. |
| \theta   |  0.11 |     2 |    1 | 0.0484 | 0.0242 | 0.0242 | 0.0121 |
| \ell/R |  0.08 |    -1 |    0 | 6.4e-3 |     0. |     0. |     0. |
| V_{3}  |  0.18 |    -1 |   -1 | 0.0324 | 0.0324 | 0.0324 | 0.0324 |
|-----+-------+-------+------+--------+--------+--------+--------|
|     |       |       |      | 0.1353 | 0.1112 | 0.1112 | 0.1489 |
#+TBLFM: $5=$2**2 $3 $3::$6=$2**2 $3 $4::$7=$2**2 $4 $3::$8=$2**2 $4 $4::@9$5..@9$8=vsum(@I..@II)

#+BEGIN_SRC python :results output
  import numpy as np
  cov = np.array([[0.1353, 0.1112], [0.1112, 0.1489]])
  #cov = np.array([[0.0841, 0.0], [0.0, 0.0324]])
  eigvals, eigvecs = np.linalg.eigh(cov)
  for i, eigval in enumerate(eigvals):
      x, y = eigvecs[:, i]
      print(
          f'sig = {np.sqrt(eigval):.3f}'
          f' in direction [{x:.3f}, {y:.3f}]'
          f' angle = {np.rad2deg(np.arctan2(y, x)):.1f} deg'
      )
  [a, b], [c, d] = cov
  theta = 0.5*np.arctan2(2*b, a - d)
  print(f'alt angle = {np.rad2deg(theta):.1f}')
  D = (a + d)**2 - 4*(a*d - b*c)
  lam1 = 0.5*((a + d) + np.sqrt(D))
  lam2 = 0.5*((a + d) - np.sqrt(D))
  print(f'alt sigs = {np.sqrt(lam1):.3f} and {np.sqrt(lam2):.3f}')
#+END_SRC

#+RESULTS:
: sig = 0.175 in direction [-0.728, 0.685] angle = 136.7 deg
: sig = 0.503 in direction [0.685, 0.728] angle = 46.7 deg
: alt angle = 46.7
: alt sigs = 0.503 and 0.175
***** Covariance for all
#+BEGIN_SRC python :return C 
  import numpy as np
  sig_x = np.diag([0.08, 0.18, 0.12, 0.12, 0.11, 0.08, 0.18])
  Df_x = np.array([
      [2, -1, 1, 0, 0, 0, 0],
      [3, -2, 1, 0, 1, 0, 0],
      [3, -1, 1, 0, 1, 0, -1],
      [2, -0.5, 0, 1, 2, -1, -1],
      [0, 1, 0, 0, 0, 0, 0]
  ])
  C = Df_x @ sig_x**2 @ Df_x.T
#+END_SRC

#+RESULTS:
|  0.0724 |  0.1176 |  0.0852 |  0.0418 | -0.0324 |
|  0.1176 |  0.2137 |  0.1489 |   0.095 | -0.0648 |
|  0.0852 |  0.1489 |  0.1489 |  0.1112 | -0.0324 |
|  0.0418 |   0.095 |  0.1112 |  0.1353 | -0.0162 |
| -0.0324 | -0.0648 | -0.0324 | -0.0162 |  0.0324 |
*** Compare stochastic heating with thermal equilibrium
+ For the smallest grains, cooling time can be smaller than time between absorptions
  + First paper on this seems to be Duley:1973a
+ See Draine:2001a
  + Fig 11 shows that for U = 1e4, this is only for grains with < 2000 carbon atoms
  + For U = 1, it is 1e6 carbon atoms
  + Corresponding radius from their equation (47):
    + a \approx 100 \AA U^{-0.2} = 0.01 \micro{}m U^{-0.2}
      |   U |  a, \micro{}m | a, nm |
      |-----+--------+-------|
      |   1 | 0.0100 |   10. |
      |  10 | 0.0063 |   6.3 |
      | 100 | 0.0040 |    4. |
      | 1e3 | 0.0025 |   2.5 |
      | 1e4 | 0.0016 |   1.6 |
      | 1e5 | 0.0010 |    1. |
      #+TBLFM: $2=0.01 / $1**0.2 ; f4::$3=1000 $-1
  + Our Cloudy models only go down to 0.005 micron, so they should all be in equilibrium if \(U > 10\).
  + Desert:1990a propose that mid-IR emission and 2175 \AA bump are both caused by a carbon VSG population with a = 1.2 \to 15 nm, which is 0.0012 \to 0.015 \micro{}m
    + Average size is about 0.01 \micro{}m 
    + So the bottom 3 size bins of the Cloudy model are in fact VSG by the Désert definition
  + The nm-sized grains are not included in the Cloudy model
    + These are the "ultrasmall" grains that Xie:2018a say are responsible for mid-ir continuum at \lambda < 10 \micro{}m (at galaxy scales)
    + Even these would be in TE for U \ge 1e5
+ [ ] Is stochastic heating important in any of our Cloudy models?
  + We could check this by running models with ~no qheat~ option
  + In principle, we might see it when U < 10
    + But there is certainly no evidence in the T vs U plot, which we should mention
  + Law:2011a have models for young stellar population where non-equilibrium heating dominates for both carbon and silicate grains below about 20 microns, although this does depend on parameters
+ Stochastic heating means that the grain temperature no longer depends on radius
+ Witt:2000a has a different way of dividing things up:
  - typical :: 100 \to 1000 nm or 0.1 \to 1 \micro{}m (this is big!)
    - these are the only ones that penetrate the heliopause and can be found in the solar system
  - small :: 5 \to 100 nm or 0.005 \to 0.1 \micro{}m
  - very small :: 0.3 \to 5 nm or 0.0003 \to 0.005 \micro{}m
+ Maximum temperature of grains absorbing a single photon of 20 eV
  + T \approx 80000 K / N
  + So if we sublime at about 1000 K, then smallest grains have N = 80 or so
  + This corresponds to a \approx 5.5 \AA, which would set the lower limit on the VSG/USG size
*** Relation between shell thickness and chord length
:PROPERTIES:
:ID:       98B7CFD9-1F8E-4D7C-8469-30E37D5C047F
:END:
+ Assuming the shell is a sphere of radius \Pi R_0
  + Where \Pi is the planitude
  + and R_0 is the apex distance
+ Then if \ell is the chord length and H is the shell thickness we have
  + H/R_0 = \Pi (1 - (1 - (\ell/2 \Pi R_0)^2)^(1/2))
+ Table given below for various values of \Pi
  + The K18 data have values 0.5 \to 4
| \ell/R_0 |           \Pi = 1 |  H/R_0, \Pi = 1.5 | \Pi = 2 | \Pi = 3 |
|-------+-----------------+-----------------+-------+-------|
|   0.5 |           0.032 |           0.021 | 0.016 | 0.010 |
|   1.0 |           0.134 |           0.086 | 0.064 | 0.042 |
|   1.5 |           0.339 |           0.201 | 0.146 | 0.095 |
|   2.0 |           1.000 |           0.382 | 0.268 | 0.172 |
|   3.0 | (1.000, -1.118) |           1.500 | 0.677 | 0.402 |
|   4.0 | (1.000, -1.732) | (1.500, -1.323) | 2.000 | 0.764 |
#+TBLFM: $2=1 (1 - sqrt(1 - ($1/ 2 1)**2)) ;f3::$3=1.5 (1 - sqrt(1 - ($1/ 2 1.5)**2)) ;f3::$4=2 (1 - sqrt(1 - ($1/ 2 2)**2)) ;f3::$5=3 (1 - sqrt(1 - ($1/ 2 3)**2)) ;f3

Plot of H/R versus \ell/R

#+BEGIN_SRC python :return figfile :results file
  import numpy as np
  from matplotlib import pyplot as plt
  import seaborn as sns

  figfile = "H_versus_ell.pdf"

  def Hfunc(ell, Pi=2.0):
      return Pi * (1.0 - np.sqrt(1.0 - (0.5*ell/Pi)**2))

  def ellfunc(H, Pi=2.0):
      return 2*Pi*np.sqrt(1.0 - (1.0 - H/Pi)**2)


  sns.set_color_codes()

  ell = np.linspace(0.0, 4.0, 200)
  H = np.linspace(0.0, 0.5, 200)

  fig, ax = plt.subplots(figsize=(6, 4))

  Pi, dPi = 1.8, 0.9
  ax.fill_betweenx(H, ellfunc(H, Pi - dPi), ellfunc(H, Pi + dPi),
                   color="k", alpha=0.2, linewidth=0)
  ax.axhline(0.3333, ls="--", lw=0.5, color="k")
  ax.plot(ellfunc(H, Pi), H, color="k")

  
  ax.set(
      xlim = [0.0, 3.9],
      ylim = [0.0, 0.65],
      ylabel = "Shell relative thickness: $H / R_0$",
      xlabel = "Shell relative chord length: $\ell / R_0$",
  )
  sns.despine()
  fig.tight_layout()
  fig.savefig(figfile)

#+END_SRC

#+RESULTS:
[[file:H_versus_ell.pdf]]

* Density versus velocity in photoevaporation flow
+ Assume isothermal:
  + 1/2 M^2 + ln n = 1/2 M_0^2 + ln n_0
  + n / n_0 = exp(-(M^2 - M_0^2)/2)

| M_0 | M |   n/n_0 | P/P_0 |
|-----+---+---------+-------|
|   1 | 2 | 0.22313 | 0.558 |
|   1 | 3 | 0.01832 | 0.092 |
|   1 | 4 | 0.00055 | 0.005 |
|   0 | 1 | 0.60653 | 1.213 |
|   0 | 2 | 0.13534 | 0.677 |
|   0 | 3 | 0.01111 | 0.111 |
|   0 | 4 | 0.00034 | 0.006 |
#+TBLFM: $3=exp(-($2**2 - $1**2)/2) ;f5::$4=$3 (1 + $2**2) / (1 + $1**2);f3
** Arc fit for LP Ori
#+BEGIN_SRC python :eval no :tangle arc-fits/lp-ori-circle-fit.py
  import sys 
  sys.path.append("/Users/will/Dropbox/circle-fit")
  import circle_fit

  fits_file = "../data/LP-Ori-HST/lp-ori-f435w.fits"

  for delta_theta in 110, 130, 150:
      plotfile = f"lp-ori-{delta_theta:03d}.pdf"
      print('#### '*10)
      print("Creating", plotfile)
      circle_fit.plot_solution(
          f"lp-ori-acs-forma.reg",
          fits_file,
          plotfile,
          delta_theta=delta_theta,
          vmin=0.0, vmax=8.0,
      )
#+END_SRC

#+BEGIN_SRC sh :results verbatim
cd arc-fits
python lp-ori-circle-fit.py
#+END_SRC

#+RESULTS:
#+begin_example
#### #### #### #### #### #### #### #### #### #### 
Creating lp-ori-110.pdf
CircleFit(Pi = 1.595, Lambda = 1.369, dLambda = 0.109)
CircleFit(Pi = 1.320, Lambda = 1.576, dLambda = -0.282)
CircleFit(Pi = 1.535, Lambda = 1.415, dLambda = -0.321)
CircleFit(Pi = 1.480, Lambda = 1.380, dLambda = -0.335)
#### #### #### #### #### #### #### #### #### #### 
Creating lp-ori-130.pdf
CircleFit(Pi = 1.595, Lambda = 1.369, dLambda = 0.109)
CircleFit(Pi = 1.315, Lambda = 1.546, dLambda = -0.180)
CircleFit(Pi = 1.386, Lambda = 1.411, dLambda = -0.286)
CircleFit(Pi = 1.360, Lambda = 1.458, dLambda = -0.242)
#### #### #### #### #### #### #### #### #### #### 
Creating lp-ori-150.pdf
CircleFit(Pi = 1.595, Lambda = 1.369, dLambda = 0.109)
CircleFit(Pi = 1.245, Lambda = 1.532, dLambda = -0.315)
CircleFit(Pi = 1.334, Lambda = 1.549, dLambda = -0.160)
CircleFit(Pi = 1.315, Lambda = 1.546, dLambda = -0.180)
#+end_example


** Arc fit for th1D
#+BEGIN_SRC python :eval no :tangle arc-fits/th1d-circle-fit.py
  import sys 
  sys.path.append("/Users/will/Dropbox/circle-fit")
  import circle_fit

  fits_file = "/Users/will/Dropbox/JorgeBowshocks/MIR/SmithBally/wcs.mos11jy.fits"

  for delta_theta in 65, 70, 75, 80:
      plotfile = f"th1D-{delta_theta:02d}.pdf"
      print('#### '*10)
      print("Creating", plotfile)
      circle_fit.plot_solution(
          f"th1d-ori-smith-2005-forma.reg",
          fits_file,
          plotfile,
          delta_theta=delta_theta,
          vmin=0.0, vmax=0.01,
      )
#+END_SRC

#+BEGIN_SRC sh :results verbatim
cd arc-fits
python th1d-circle-fit.py
#+END_SRC

#+RESULTS:
#+begin_example
#### #### #### #### #### #### #### #### #### #### 
Creating th1D-65.pdf
CircleFit(Planitude = 1.863668610945027, Alatude = [ 1.5174858   1.47936061])
CircleFit(Planitude = 1.4369575034558033, Alatude = [ 1.34236887  1.37510133])
CircleFit(Planitude = 1.4369575034558033, Alatude = [ 1.34236887  1.37510133])
CircleFit(Planitude = 1.4369575034558033, Alatude = [ 1.34236887  1.37510133])
#### #### #### #### #### #### #### #### #### #### 
Creating th1D-70.pdf
CircleFit(Planitude = 1.863668610945027, Alatude = [ 1.5174858   1.47936061])
CircleFit(Planitude = 1.4078624613676836, Alatude = [ 1.33984663  1.3714574 ])
CircleFit(Planitude = 1.5558494149676698, Alatude = [ 1.37294133  1.38619122])
CircleFit(Planitude = 1.5558494149676698, Alatude = [ 1.37294133  1.38619122])
#### #### #### #### #### #### #### #### #### #### 
Creating th1D-75.pdf
CircleFit(Planitude = 1.863668610945027, Alatude = [ 1.5174858   1.47936061])
CircleFit(Planitude = 1.5029029947873929, Alatude = [ 1.37811972  1.38004071])
CircleFit(Planitude = 1.5029029947873929, Alatude = [ 1.37811972  1.38004071])
CircleFit(Planitude = 1.5029029947873929, Alatude = [ 1.37811972  1.38004071])
#### #### #### #### #### #### #### #### #### #### 
Creating th1D-80.pdf
CircleFit(Planitude = 1.863668610945027, Alatude = [ 1.5174858   1.47936061])
CircleFit(Planitude = 1.5029029947873929, Alatude = [ 1.37811972  1.38004071])
CircleFit(Planitude = 1.5029029947873929, Alatude = [ 1.37811972  1.38004071])
CircleFit(Planitude = 1.5029029947873929, Alatude = [ 1.37811972  1.38004071])
#+end_example

Do the bootstrap resampling
#+BEGIN_SRC sh :eval no
cd arc-fits
python ~/Dropbox/circle-fit/plot-bootstrap.py th1d-ori-smith-2005-forma.reg ~/Dropbox/JorgeBowshocks/MIR/SmithBally/wcs.mos11jy.fits 75 0.5 bootstrap-th1d-75-05.pdf
#+END_SRC




